[
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 1,
        "name": "Dubu Salad (Korean Tofu Salad)",
        "image": "images/recipe_1_dubu_salad_korean_tofu_salad_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1packagesoft or silken tofu",
            "▢2ouncesspring salad mix",
            "▢2scallions (1 if large), finely chopped, about 1/4 cup",
            "▢1/2teaspoonminced garlic",
            "▢2tablespoonssoy sauce",
            "▢1tablespoonvinegar or lemon juice",
            "▢1tablespoonrice wine (mirin, mirim (미림), or matsul (맛술))",
            "▢1teaspoonsugaror 2 teaspoons Korean plum syrup -maesilcheong, 매실청",
            "▢1/2teaspoongochugaru (Korean red chili pepper flakes)Adjust to taste",
            "▢1teaspoonsesame oil",
            "▢2teaspoonssesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix all the sauce ingredients in a small bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Wash the spring mix and drain."
            },
            {
                "@type": "HowToStep",
                "text": "In a medium size pot, bring about 4 cups of water to a boil and add the tofu. Cover and boil for 5 minutes over medium heat."
            },
            {
                "@type": "HowToStep",
                "text": "Carefully transfer the tofu to a colander to drain and cool."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the tofu into two blocks. Cut each block into about 1/2-inch thick slices."
            },
            {
                "@type": "HowToStep",
                "text": "Spread some spring mix on a plate. Arrange the tofu slices on top of the spring mix. Drizzle the sauce over the tofu when ready to serve."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "Simple Korean-style tofu salad - Korean yangnymjang (soy dipping sauce) deliciously complements the nutty tofu and slightly peppery and bitter spring mix."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 2,
        "name": "Korean Fried Chicken",
        "image": "images/recipe_2_korean_fried_chicken.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2poundschicken wings (about 16 drumettes and wingettes)",
            "▢1.5teaspoonssalt (use 1 ts if using table salt)",
            "▢pinchblack pepper (or to taste)",
            "▢1teaspoongrated ginger",
            "▢4-5cupsoil for fryingabout 2-inch deep (use deep, bottom heavy, medium size pot or pan)",
            "▢1/2cuppotato starch (or cornstarch)",
            "▢1/2cupfrying mix (aka tempura mix)or all-purpose flour with 1/2 teaspoon baking powder, 1/4 teaspoon salt, and optional 1/2 teaspoon garlic powder or onion powder.",
            "▢1/4cuppotato starch (or cornstarch)",
            "▢3/4cupwater",
            "▢1tablespoonsoy sauce",
            "▢2tablespoonsrice wine (or mirin) or other cooking wine",
            "▢1tablespoonor 1.5 tablespoons gochujang",
            "▢1tablespoonor 2 tablespoons hot sauce (sriracha, tabasco, Franks Original, etc.)You can use 2 Tbs ketchup instead along with a teaspoon vinegar, if you don't want extra heat.",
            "▢2tablespoonssugar",
            "▢2tablespoonshoney (or 2.5 tablespoons corn syrup, rice syrup, or oligo syrup)",
            "▢1tablespoonminced garlic",
            "▢1/2teaspoonhoney dijon mustard - optional",
            "▢4tablespoonswater",
            "▢2tablespoonssoy sauce",
            "▢2tablespoonsrice wine (or mirin or other cooking wine)",
            "▢2tablespoonssugar",
            "▢2tablespoonshoney (or 2.5 tablespoons corn syrup, rice syrup, or oligo syrup)",
            "▢1tablespoonminced garlic",
            "▢1teaspoonvinegar (white, rice, apple cider, etc.)",
            "▢1teaspoonor 2 teaspoons oyster sauce - optional",
            "▢4tablespoonswater",
            "▢1/2teaspoonsesame seeds",
            "▢1tablespoonchopped scallion"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Wash chicken wings, and drain thoroughly. Mix with the salt, pepper, and ginger. Let it sit in the fridge for 2 hours or longer (overnight to 24 hours)."
            },
            {
                "@type": "HowToStep",
                "text": "Combine all the sauce ingredients of your choice and stir well. Boil over medium heat until it thickens slightly, about 4 to 5 minutes. Turn the heat off."
            },
            {
                "@type": "HowToStep",
                "text": "OPTION 1 Dry batter:If using the starch only, add the potato (or cornstarch) to the chicken, and rub it onto each wing well to coat evenly. Set aside."
            },
            {
                "@type": "HowToStep",
                "text": "OPTION 2 Wet batter:Mix the wet batter ingredients in a bowl, and stir well until smooth with no visible lumps."
            },
            {
                "@type": "HowToStep",
                "text": "Add the oil to a deep fryer, wok, or large pot. Heat the oil to 320°F (up to 330°F). Drop the chicken in the oil, one piece at a time. If using wet batter, dip each piece in the wet batter with tongs and shake off excess batter before dropping the chicken in the oil. Fry them in two batches. Cook until lightly golden, about 6 minutes, depending on the size of the chicken wings. Remove them with a wire skimmer or a slotted spoon. Drain on a wire rack or in a large mesh strainer set on a bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Reheat the oil to 350°F (up to 360°F). Add the chicken (you can do this in one batch for the second frying), and deep fry again, for about 5 minutes, until golden brown. Drain on a wire rack or in a large mesh strainer set on a bowl."
            },
            {
                "@type": "HowToStep",
                "text": "You can either toss the fried chicken pieces in the sauce or hand-brush them. Sprinkle with the optional sesame seeds or chopped scallion to serve."
            }
        ],
        "recipeYield": "Servings:4people",
        "prepTime": "PTPrep Time:25minutesminutes",
        "cookTime": "PTCook Time:20minutesminutes",
        "description": "Korean fried chicken with a thin, crackly crust that's glazed with a delicious soy garlic or red spicy sauce! "
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 3,
        "name": "Gilgeori Toast (Korean Street Toast)",
        "image": "images/recipe_3_gilgeori_toast_korean_street_toast_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2slicesbread (white, wheat, multi-grain, or milk bread)",
            "▢3ouncesgreen cabbage, yangbaechu (양배추) up to 4 ounces1 cup, packed",
            "▢½small carrot (about 0.5 ounces)",
            "▢¼small onion (about 0.5 ounces)",
            "▢2stalksgarlic chives, buchu (or 1 small scallion)",
            "▢1large eggsee note",
            "▢salt and pepper to taste",
            "▢2tablespoonsbutter (or margarine or olive oil), or to taste, divided",
            "▢sugar to tasteHalmeoni Toast uses a heaping tablespoon",
            "▢ketchup to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Thinly slice the cabbage, onion, and carrot. Cut the garlic chives into about 1.5-inch long pieces. If using a scallion, thinly slice diagonally."
            },
            {
                "@type": "HowToStep",
                "text": "In a large non-stick pan, melt butter or margarine (use as needed or to taste) over medium heat. Place both slices of the bread, moving them around and flipping over. Toast until golden-brown, 1 to 2 minutes on each side. Transfer to a plate."
            },
            {
                "@type": "HowToStep",
                "text": "In a small, deep bowl or cup (2-cup size), place the veggies (reserving about 1/5) along with a pinch of salt. Crack the egg in it. Mix everything well by hitting them down with a pair of tongs or a fork until the veggies and egg are well incorporated and reduced in volume, about 20 seconds."
            },
            {
                "@type": "HowToStep",
                "text": "In the same pan, melt some more butter or margarine over medium heat. Add the egg and veggie mixture, flattening and shaping it to a large round with a spatula. Place the reserved veggies on top. Cook the mixture until it turns lightly golden, about 3 minutes. Carefully flip it over with a spatula, add more butter or margarine, and cook the other side for about 2 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Place the omelet on one piece of toast. Sprinkle it with sugar and top with a good squirt of ketchup to taste, and place the other slice of bread on top and serve."
            }
        ],
        "recipeYield": "Servings:1",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:5minutesminutes",
        "description": "This veggie-packed Korean street toast is easy and delicious! Experience the streets of Korea with a few basic ingredients.  "
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 4,
        "name": "Hobak Jeon (Pan-fried Zucchini in Egg Batter)",
        "image": "images/recipe_4_hobak_jeon_pan_fried_zucchini_in_egg_batter_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2zucchinis (about 10 ounces each)",
            "▢salt",
            "▢a red pepper and small leaflets of green leafy vegetables such as minari, ssukgat, and parsleyOptional decorations",
            "▢2large eggs, beaten",
            "▢1/4cupflour",
            "▢oil for pan frying",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonwater",
            "▢1teaspoonvinegar (or more to taste)",
            "▢You can also add a bit of sugar and/or black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Slice the zucchini into rounds (about ⅓ - inch thickness). Lightly salt both sides and set aside until softened and released some moisture, about 15 to 20 minutes depending on the zucchinis. Shake off excess moisture from the salted zucchini slices."
            },
            {
                "@type": "HowToStep",
                "text": "Dredge both sides of the zucchini pieces in flour, one piece at a time. (Do this step for all the pieces before the next step.)"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large non-stick pan with a tablespoon of oil over medium heat. Dip each piece one at a time in the egg wash, and carefully place in the heated pan."
            },
            {
                "@type": "HowToStep",
                "text": "Cook until lightly golden, about a minute depending on the thickness and heat level. Place an optional decorative red pepper slice or green leaflet on top when the egg is almost set but still wet. Flip them over when the bottom edges turn lightly golden, and cook for another minute or so. Add more oil if necessary. Do not overcook."
            },
            {
                "@type": "HowToStep",
                "text": "Repeat until all the pieces are pan fried. Add an additional tablespoon of oil each time. Serve warm with the dipping sauce."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "These hobak jeon (Korean zucchini fritters) are pan-fried quickly in egg batter. They are delicious with summer's abundant zucchinis!   Zucchini"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 5,
        "name": "Minari Jeon (Water Dropwort Pancake)",
        "image": "images/recipe_5_minari_jeon_water_dropwort_pancake_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1/2cupbuchimgaru, 부침가루 (Korean pancake mix) or all-purpose flour (see note)",
            "▢4ouncesminari",
            "▢1red chili pepper - optional",
            "▢oil for pan frying",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchblack pepper",
            "▢pinchgochugaru (Korean red chili pepper flakes) - optional"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Clean the minari thoroughly. Cut them into about 2 to 3-inch pieces."
            },
            {
                "@type": "HowToStep",
                "text": "Add the minari to a bowl along with the Korean pancake mix or all-purpose flour. Stir in about 1/2 cup of cold water."
            },
            {
                "@type": "HowToStep",
                "text": "Toss everything lightly to evenly coat the vegetable with wet flour."
            },
            {
                "@type": "HowToStep",
                "text": "Heat one tablespoon of oil in a non-stick pan over medium heat. Ladle the mixture into the pan, and spread it evenly into a thin round shape. Cook until light golden brown, about 2 minutes. Reduce the heat to medium low if the pancake browns too quickly. Turn it over, adding more oil to the sides of the pan, and press it down with a spatula. Cook until the other side is light golden brown, about 2 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Repeat the process with the remaining vegetable mix. Serve hot with a dipping sauce, if desired."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": null,
        "description": "Minari jeon is a simple Korean savory pancake made with minari (aka water dropwort or Korean watercress). This recipe is a great way to enjoy the"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 6,
        "name": "Bossam (Boiled Pork Wraps)",
        "image": "images/recipe_6_bossam_boiled_pork_wraps_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢tender inner parts of 1 napa cabbage, saltedor red or green leaf lettuce",
            "▢(Dissolve 1/2 cup coarse salt in 4 cups of water, and soak the cabbage leaves until softened, 2 to 4 hours. Rinse and drain well.)",
            "▢Radish salad, musaengchae - Seerecipe.",
            "▢saewujeot (salted shrimp)use it as is or mix with a little bit of gochugaru, sesame oil and seeds, and chopped scallion",
            "▢2whole fresh pork belly about 3-inch wide cutabout 2.5 pounds",
            "▢1/2medium onion",
            "▢2 - 3white parts of large scallions",
            "▢7 - 8plump garlic cloves",
            "▢1inchginger (thumb size), sliced",
            "▢1teaspoonwhole black peppers",
            "▢1.5tablespoonsdoenjang, fermented soybean paste",
            "▢1teaspooninstant coffee, or a cup of brewed coffeeor a small bottle (or can) of beer - 12 ounces",
            "▢1teaspoonsalt",
            "▢2bay leaves",
            "▢7 to 8cupswater (see note)if using brewed coffee or beer, reduce the amount of water by the equal amount"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a pot, bring water and all the brine ingredients to a boil over medium high heat, and continue to boil for 5 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Add the pork belly, bring it to a boil. and boil for about 5 minutes, uncovered. Reduce the heat to medium, and cook, covered, until the meat is very tender, 45 to 50 minutes. Cut a small slice and try if tender at 40 minute point before cooking longer. Turn the heat off, and cool the meat in the cooking liquid. This will keep the meat moist."
            },
            {
                "@type": "HowToStep",
                "text": "Thinly slice the meat and serve with the salted cabbage (or lettuce), saewujeot, and musaengchae."
            }
        ],
        "recipeYield": "Servings:6",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:1hourhour",
        "description": "Bossam is boiled pork traditionally served with cabbage wraps. The meat is boiled in a flavorful brine until tender and served thinly sliced. "
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 7,
        "name": "Baked Chicken Wings",
        "image": "images/recipe_7_baked_chicken_wings.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢24wing piecesabout 3 pounds for each marinade",
            "▢4tablespoonsgochujang Korean red chili pepper paste",
            "▢4tablespoonsbarbecue sauceany type",
            "▢2tablespoonssoy sauce",
            "▢2tablespoonsrice wine or mirin (or white wine)",
            "▢1tablespoonsesame oil",
            "▢1tablespoonhoney",
            "▢1tablespoonminced garlic",
            "▢1teaspoonfinely grated ginger",
            "▢1/4teaspoonpepper",
            "▢1/2cupsoy sauce",
            "▢3tablespoonsrice wine or mirin",
            "▢1tablespoonlemon juice",
            "▢2tablespoonsextra virgin olive oil",
            "▢2tablespoonshoney",
            "▢1tablespoonbrown sugar",
            "▢1tablespoonminced garlic",
            "▢2teaspoonsgrated ginger",
            "▢1/4teaspoonpepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse the chicken wings and drain the water. Mix all the ingredients for each marinade together."
            },
            {
                "@type": "HowToStep",
                "text": "Combine the marinade with the chicken wings and coat all the pieces well. Cover and refrigerate for 2 to 4 hours (overnight for best results). Let them sit at room temperature for 30 minutes before cooking. Preheat the oven to 425°F (218°C)."
            },
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with aluminum foil. Place the chicken wings in a single layer and bake for 20 to 25 minutes until the skin is crisp and golden. Flip them over halfway through and baste/spoon the remaining marinade over each wing.Alternatively:Bake them at 400°F (204°C) for 15 minutes, flip them over, bake for another 15 minutes. Then, increase the oven temperature to 425°F, baste, and bake for another 10 minutes. This worked really well too."
            },
            {
                "@type": "HowToStep",
                "text": "Turn them over halfway during baking and baste with the leftover marinade. Reduce the heat level if the wings are browning too quickly. (See notes.)"
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:30minutesminutes",
        "description": "These Korean-flavored baked chicken wings are finger-licking delicious! The recipe includes two different marinades -- savory and spicy."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 8,
        "name": "15 Game Day Korean Recipes",
        "image": "images/recipe_8_15_game_day_korean_recipes.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [],
        "recipeInstructions": [],
        "recipeYield": null,
        "prepTime": null,
        "cookTime": null,
        "description": "If you like to try something different and exciting for your game day, here's a collection of 15 Korean party or snack dishes. Enjoy!! Are you looking for Here's a collection of 10 Korean party or snack dishes for your game day. Try some of these recipes for a nice change or a great addition to your standard Super Bowl fare."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 9,
        "name": "Gungjung Tteokbokki (Royal Court Rice Cake)",
        "image": "images/recipe_9_gungjung_tteokbokki_royal_court_rice_cake_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundthin garaetteok/tteokbokki tteokabout 2-inch long pieces",
            "▢4ounceslean beefsirloin, eye round, chuck tender or rib eye",
            "▢3or 4 shiitake mushroomsfresh or soaked if dried",
            "▢1/2medium zucchini (about 4 ounces)You can also use garlic chives and/or colorful bell peppers.",
            "▢1medium carrotcut into thin, 2-inch strips",
            "▢1/2medium sweet onionthinly sliced",
            "▢1 to 2scallionscut into 2-inch lengths",
            "▢salt",
            "▢cooking oil for stir-frying",
            "▢3tablespoonssoy sauce",
            "▢1tablespoonrice wineor mirin",
            "▢1tablespoonsugar",
            "▢1tablespoonsesame oil",
            "▢1teaspoonsesame seeds",
            "▢2teaspoonsminced garlic",
            "▢pinchpepper",
            "▢ginkgo nuts or pine nuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the sauce ingredients well and set aside. Bring water to a boil in a medium size pot. Add the rice cake pieces. Boil until all the pieces float to the top. The time required will vary depending on the condition of rice cakes. The rice cakes will be very soft when cooked, but they will become harder as they cool. Drain them out with a sieve. Do not rinse. Mix with 2 tablespoons of the prepared sauce. Set aside."
            },
            {
                "@type": "HowToStep",
                "text": "Thinly slice the beef into about 2-inch long strips. Cut stems off the mushrooms and slice into thin strips. Place the beef and mushrooms in a bowl, and mix in a tablespoon of the prepared sauce. Marinate while preparing the other ingredients."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the zucchini in half lengthwise and then thinly slice crosswise and slightly diagonally to make the cuts longer. Generously sprinkle salt over zucchini slices, and set aside for 10 - 15 minutes. Squeeze out excess liquid from the zucchini by hand. In a lightly heated and oiled skillet, stir fry the onion, carrot, and zucchini over medium high heat, about 2 minutes. Add the scallion at the end (not in the photo). Transfer to a bowl."
            },
            {
                "@type": "HowToStep",
                "text": "In the same skillet, cook the beef and mushrooms over medium high heat until the meat is cooked through, 1 to 2 minutes. Reduce the heat to medium low. Add the rice cakes and stir fry for another minute or two. Turn the heat off."
            },
            {
                "@type": "HowToStep",
                "text": "Add the rice cakes to the bowl with the vegetables, along with the optional ginkgo or pine nuts, and the remaining sauce. Toss well to combine everything well. Adjust the seasoning with additional soy sauce or sugar as necessary. Serve warm."
            }
        ],
        "recipeYield": "Servings:0",
        "prepTime": "PTPrep Time:15minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "Gungjung tteokbokki, a royal court dish, is mildly flavored with a soy sauce based sauce. It's slightly sweet and deliciously savory!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 10,
        "name": "Shrimp Dumplings (Saeu Mandu)",
        "image": "images/recipe_10_shrimp_dumplings_saeu_mandu_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢32dumpling wrappers (store-bought orhomemade)See note 1",
            "▢12ounces(340 grams) raw shrimpPeeled and deveined",
            "▢10ounces(280 grams) green cabbage",
            "▢4ounces(110 grams) fresh mushroom caps, stems removed(shiitake, button, crimini, etc.)",
            "▢1/2small onion",
            "▢1teaspoonminced garlic",
            "▢1teaspoonfinely grated gingeror juiced",
            "▢1teaspoonsoy sauce",
            "▢2teaspoonssesame oil",
            "▢salt to tasteabout 1/4 teaspoon",
            "▢pinchpepper",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢pinchof black pepperand/or gochugaru (red chili pepper flakes)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Coarsely chop the shrimp or pulse several times in a food processor. Finely chop the cabbage. Mix with 1 teaspoon of salt. Let sit for 5 - 10 minutes. Squeeze out excess water. (If using a food processor, add salt with the cabbage before pulsing.) Finely chop the onion and mushrooms. Combine all the filling ingredients in a large bowl. Mix well by hand."
            },
            {
                "@type": "HowToStep",
                "text": "Place a tablespoon of the filling on a wrapper. You don't need to wet the edges of the homemade wrapper. Seal tightly (pushing the air out with your fingers) into a half-moon shape. (You can add pleats if desired.) Dust the bottom of the dumpling with flour to keep it from sticking as the skin absorbs the moisture from the filling. Repeat this process until all the filling/wrappers are used."
            },
            {
                "@type": "HowToStep",
                "text": "Steaming:steam the dumplings for about 10 minutes in a steamer (longer if frozen). Make sure to line the steamer with a wet cheesecloth or paper towel to prevent the mandu from sticking."
            },
            {
                "@type": "HowToStep",
                "text": "Boiling:bring a pot of water to a boil. Add mandu (stirring gently so they don't stick to the bottom of the pot), a few at a time, and cook until all of them come up to the surface. Continue to cook for another minute or two."
            },
            {
                "@type": "HowToStep",
                "text": "Pan frying, heat the pan with 1 tablespoon of vegetable oil over medium high heat. Add the dumplings, making sure they aren't touching each other. Fry for 1 - 2 minutes, until the bottoms are golden brown. Add 1/4 cup of water to the pan, and cover immediately with a lid. Reduce the heat to medium low, and steam for 4 to 5 minutes. If the dumplings are frozen, cook a little longer."
            }
        ],
        "recipeYield": "Servings:32dumplings",
        "prepTime": "PTPrep Time:30minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "Filled with shrimp and lots of healthy vegetables, these shrimp dumplings are easy to make, juicy and flavorful!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 11,
        "name": "Dakgangjeong (Sweet Crispy Korean Fried Chicken)",
        "image": "images/recipe_11_dakgangjeong_sweet_crispy_korean_fried_chicken_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundbonelessskinless chicken thigh and/or breast",
            "▢1/2cupmilkoptional",
            "▢1/4teaspoonsalt",
            "▢pinchpepper",
            "▢1/2teaspoonminced garlic",
            "▢1/2teaspoonminced ginger",
            "▢1tablespoonrice wineif not using milk",
            "▢⅓cuppotato starchor corn starch",
            "▢oil for deep frying",
            "▢1tablespoonsoy sauce",
            "▢3tablespoonsrice wineor mirin",
            "▢2tablespoonsapple cider vinegaror rice wine vinegar",
            "▢1tablespoongochujang, 고추장 (Korean red chili pepper paste)Omit for a mild version and add 1 more tablespoon soy sauce (Also see note)",
            "▢3tablespoonshoneyor corn or rice syrup (use 4 tablespoons)",
            "▢2teaspoonssesame oil",
            "▢2tablespoonsbrown sugar",
            "▢1teaspoonminced garlic",
            "▢1teaspoongrated ginger",
            "▢pinchpepper",
            "▢1 to 2tablespoonscoarsely chopped peanuts or seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove any visible fat. Cut the chicken into bite sized pieces."
            },
            {
                "@type": "HowToStep",
                "text": "Soak the chicken pieces in milk for at least 30 minutes in the fridge. This step is optional."
            },
            {
                "@type": "HowToStep",
                "text": "Drain well. Mix with the salt, pepper, rice wine (if you didn’t use milk) garlic, and ginger. Let it sit for 20 to 30 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "In a pan, add all the sauce ingredients, and stir well. Bring it to a boil. When it starts to bubble, reduce the heat to medium low, and simmer until it thickens slightly, about 3 to 4 minutes. Turn the heat off."
            },
            {
                "@type": "HowToStep",
                "text": "Coat each chicken piece well with the potato (or corn) starch."
            },
            {
                "@type": "HowToStep",
                "text": "Pour about 1 inch of oil in to a heavy bottom pan. Use a narrow and deep pan if available, When the oil is sufficiently hot (330°F), drop the chicken pieces in one at a time. Fry them in two batches. Overcrowding will drop the oil temperature too quickly. Cook until light golden brown, about 3 minutes. Remove and set them on a wire rack or a paper towel-lined plate."
            },
            {
                "@type": "HowToStep",
                "text": "Reheat the oil to 330°F. Deep fry again until golden brown, about a minute or two. You can do the second frying in one batch."
            },
            {
                "@type": "HowToStep",
                "text": "Heat the sauce over medium low heat. Add the chicken and stir well until the chicken pieces are evenly coated."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "Dakgangjeong is a crispy Korean fried chicken glazed in a sticky, sweet, tangy and spicy sauce. So addictive! Easy to make at home!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 12,
        "name": "Japchae (Stir-Fried Starch Noodles with Beef and Vegetables)",
        "image": "images/recipe_12_japchae_stir_fried_starch_noodles_with_beef_and_vegetables_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢7ouncesKorean potato starch noodles (dangmyeon, 당면)",
            "▢1carrot (about 3 ounces)",
            "▢1/2medium onion, preferably sweet variety, (4 to 5 ounces)",
            "▢2scallions",
            "▢4ounceslean tender beef (sirloin, chuck tender, rib eye, etc.)or pork loin",
            "▢3 to 4ouncesfresh shiitake mushrooms (or 4 to 5 dried shiitake, soaked until plump)Or oyster mushrooms, wood ear mushrooms or button mushrooms. See note 1.",
            "▢6ouncesfresh spinach (preferably a bunch of spinach)",
            "▢oil for stir frying",
            "▢salt",
            "▢egg garnish (jidan) - optional",
            "▢3.5tablespoonssoy sauce",
            "▢3tablespoonssugar (or brown sugar)You can use a little less if you want.",
            "▢2tablespoonssesame oil",
            "▢2teaspoonsminced garlic",
            "▢1tablespoonroasted sesame seeds",
            "▢black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Clean all the ingredients. Cut the carrot into matchsticks. Thinly slice the onion. Run the knife through the white parts of the scallions lengthwise, if thick, and then cut into about 2-inch long pieces. Remove the stems from the mushrooms, and slice into 1/4-inch thin strips. Cut the meat into thin 2-inch long strips."
            },
            {
                "@type": "HowToStep",
                "text": "Combine all the sauce ingredients in a small bowl and mix well until the sugar is dissolved."
            },
            {
                "@type": "HowToStep",
                "text": "In a large non-stick pan (see note 2), bring about 5 cups of water to a boil, and cook the noodles until completely translucent and soft (6 to 8 minutes). Drain in a strainer and rinse under cold running water. Drain well. Roughly cut the noodles with a pair of kitchen shears or a knife into 6 -7 inch lengths. Transfer to a large mixing bowl. Mix well with 3 tablespoons of the prepared sauce."
            },
            {
                "@type": "HowToStep",
                "text": "Fill the same pan with 2 cups of water. When water boils, blanch the spinach only until wilted. Drain quickly and shock in cold water. Squeeze out water, run a knife through the squeezed spinach a couple of times, and lightly season with salt."
            },
            {
                "@type": "HowToStep",
                "text": "Add 1/2 tablespoon of oil to the skillet, and stir fry the noodles over medium to medium high heat, stirring frequently, until translucent and a bit sticky (about 4 minutes). Transfer back to the mixing bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Add 1/2 tablespoon of oil to the pan, and stir fry the carrot over medium high heat, sprinkling with a pinch of salt. When the carrot sticks are half way cooked, about a minute, push them to one side of the pan to make room for the onion slices. Stir-fry the onion slices until translucent, sprinkling with a pinch of salt. Stir-in the scallion and cook briefly. Do not overcook. The vegetables should be crisp. Transfer to the bowl with the noodles."
            },
            {
                "@type": "HowToStep",
                "text": "Add the beef and mushrooms along with 2 tablespoons of the prepared sauce and cook until the meat is cooked through, 2 - 3 minutes. Transfer to the bowl with the noodles."
            },
            {
                "@type": "HowToStep",
                "text": "Add the spinach and the remaining sauce to the bowl with all other prepared ingredients. Toss well by hand. Adjust the seasoning to taste by adding a little more (start with 1/2 teaspoon) soy sauce and/or sugar as necessary."
            },
            {
                "@type": "HowToStep",
                "text": "Separate the egg white and yolk. Lightly beat the white by gently cutting it with a spoon. Stir the yolk with a spoon until smooth. Heat a lightly oiled nonstick skillet over medium low heat. Pour each egg part into a thin layer, by tilting the skillet and/or spreading with a spoon. Cook each side briefly. (Do not brown the egg.) Roll it and thinly slice."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": "PTPrep Time:15minutesminutes",
        "cookTime": "PTCook Time:20minutesminutes",
        "description": "Japchae is a classic Korean dish everyone loves! Find out how to make authentic, delicious japchae with this time tested recipe!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 13,
        "name": "Beoseot Gangjeong (Sweet Crispy Mushrooms)",
        "image": "images/recipe_13_beoseot_gangjeong_sweet_crispy_mushrooms_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2ouncesdried shiitake mushroomsSee note",
            "▢1/4bell pepperred, orange or yellow or a combination",
            "▢1/4cuppotato starch or cornstarch",
            "▢oil for deep frying",
            "▢1tablespoonsoy sauce",
            "▢1tablespoongochujang (Korean red chili pepper paste)",
            "▢1tablespoonvinegar (rice wine vinegar or any other clear vinegar)",
            "▢2tablespoonsrice syrup (jocheong, 조청), corn syrup, or oligodang (올리고당)or 1 to 1.5  tablespoons honey",
            "▢2tablespoonsrice wine (or mirin)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the dried mushrooms until they are plump and tender. This will take over 2 hours depending on the size of the mushrooms."
            },
            {
                "@type": "HowToStep",
                "text": "Squeeze out the water from the soaked mushrooms, and then cut the mushrooms into quarters (or halves if small). Cut the peppers into small pieces."
            },
            {
                "@type": "HowToStep",
                "text": "Add the potato (or corn) starch to the mushrooms, and massage them well to coat evenly."
            },
            {
                "@type": "HowToStep",
                "text": "In a pan, add all the sauce ingredients, and stir well. Bring it to a boil. When it starts to bubble, reduce the heat to medium low, and simmer until it thickens slightly, about 4 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Add oil to a heavy bottom pan, about 1/2 inch high. When the oil is sufficiently hot (about 320°F), drop the mushroom pieces in one at a time. Cook until light golden brown, 1 to 2 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Remove and set them on a wire rack or a paper towel-lined plate."
            },
            {
                "@type": "HowToStep",
                "text": "Reheat the oil to 320°F. Deep fry again until golden brown, about a minute."
            },
            {
                "@type": "HowToStep",
                "text": "Heat the sauce over medium heat. Add the mushrooms and peppers, and stir well until the mushroom pieces are evenly coated."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "Deep-fried crispy mushrooms glazed in a sweet and sour sauce with a spicy kick. The lightly coated mushrooms are deep-fried in shallow oil."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 14,
        "name": "Kimchijeon (Kimchi Pancake)",
        "image": "images/recipe_14_kimchijeon_kimchi_pancake_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1cupthinly sliced fully-fermented kimchi",
            "▢1 to 2scallionsTwo if thin and small",
            "▢1/4medium onion",
            "▢3ouncesminced pork, canned tuna (without the liquid), or squid cut into small strips - optional",
            "▢cooking oil with high smoke point for pan frying",
            "▢1 1/4cupsall-purpose flour or buchimgaru (Korean pancake premix)or Swap 1/4 cup of all-purpose flour with sweet rice flour or corn/potato starch",
            "▢2 to 3tablespoonsjuice/liquid from kimchiSee note on water below",
            "▢1 or 2teaspoonsgochujang (Korean chili pepper paste) or gochugaru - optional",
            "▢1lightly beaten egg - optional",
            "▢1cupicy cold waterUse more water if juice/liquid from kimchi is unavailable and not using an egg. Flour to liquid should be about 1:1 ratio in total.",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchof black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Thinly slice the kimchi, about 1/2-inch thick. Cut the scallions into about 2-inch pieces. If the white part is thick, cut in half lengthwise. Thinly slice the onion."
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the flour (or pancake mix) with the liquid from kimchi, the optional gochujang/gochugaru and egg, and water, a little bite at a time. Start with dissolving the gochujang with water, and mix everything together. Do not over mix."
            },
            {
                "@type": "HowToStep",
                "text": "Add a little more water if the batter is too thick. The batter should flow easily from a spoon."
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the kimchi, scallions, onion and the optional protein of your choice."
            },
            {
                "@type": "HowToStep",
                "text": "Heat one tablespoon of oil in a non-stick pan over medium heat. Ladle the mixture into the pan, and spread it evenly into a thin round shape. Cook until the edges turn light golden brown, about 3 minutes. Turn it over, and add more oil to the sides of the pan. Gently swirl the pan to distribute the oil under the pancakes. Press the pancake down with a spatula. Cook until the other side is nicely browned and crispy, 2 to 3 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Repeat the process until there is no remaining batter. Serve hot with a dipping sauce, if desired."
            }
        ],
        "recipeYield": "Servings:3",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:12minutesminutes",
        "description": "This crispy flavor-packed kimchi pancakes are super easy to make with a few basic ingredients as long as you have some well fermented kimchi."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 15,
        "name": "Gyeran Mari (Rolled Omelette) with Seaweed",
        "image": "images/recipe_15_gyeran_mari_rolled_omelette_with_seaweed.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢3eggs (see note 1)",
            "▢1sheet gim (김) - dried seaweed (aka nori)See note 1",
            "▢pinchsalt",
            "▢oil for the pan"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Crack and beat the eggs, in a bowl with a spoon or a fork, until the yolks and whites are blended well with no visible strings of whites. Stir in a pinch of salt. (If using, stir in chopped vegetables.)"
            },
            {
                "@type": "HowToStep",
                "text": "Add a teaspoon of vegetable oil to a medium size non-stick pan and distribute the oil evenly using a napkin or paper towel. Preheat over medium low heat, until it feels hot when you place your hand 2 to 3 inches above the bottom of the pan."
            },
            {
                "@type": "HowToStep",
                "text": "Add ⅔ of the eggs to the pan. Swirl it around to cover the pan. (Reduce the heat or raise the pan away from the heat, for a little while, if the egg is cooking too fast.) See note 2."
            },
            {
                "@type": "HowToStep",
                "text": "When the egg is set but the surface is still wet, add a sheet of gim. Pour the remaining egg over the gim and swirl the pan around to spread the egg mixture evenly."
            },
            {
                "@type": "HowToStep",
                "text": "When the egg surface is set again, using a spatula, lift one end of the egg (about 1-1/2 inch) and fold it over to the other side. Quickly lift the folded part and fold it again. (The egg should be slightly wet while being folded, or the roll will become loose when sliced.)"
            },
            {
                "@type": "HowToStep",
                "text": "Repeat the process until an egg log is created."
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the pan and let cool for about 5 minutes. Slice the egg into thick, even pieces (3/4 to 1-inch thick)."
            }
        ],
        "recipeYield": "Servings:0",
        "prepTime": null,
        "cookTime": null,
        "description": "Easy Korean rolled omelette made simply with seaweed (gim), which adds a distinct flavor and a beautiful contrast of color. What is gyeran mari? Gyeran Gyeran mari (Korean rolled egg) made with gim (aka nori). This definitely is a family favorite!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 16,
        "name": "Gamjajeon (Potato Pancakes)",
        "image": "images/recipe_16_gamjajeon_potato_pancakes_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1/4medium onion - optional (see note)",
            "▢1-1/2poundspotatoes (2 large or 3 medium)",
            "▢1/4teaspoonsalt",
            "▢2ouncesgarlic chives (buchu, 부추) - Optional",
            "▢oil for pan frying",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchof black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grate the optional onion (about 2 to 3 tablespoons). Place in a large bowl. Peel and grate the potatoes, capturing the liquid. If using a blender or food processor, grind the onion and potatoes together."
            },
            {
                "@type": "HowToStep",
                "text": "Drain the grated potato in a bowl lined with a strainer, reserving the liquid. Immediately transfer to the bowl with the grated onion, and mix well with the optional onion to prevent discoloring of the potato."
            },
            {
                "@type": "HowToStep",
                "text": "Let the reserved liquid sit for about 10 minutes. The starch in the liquid will sink to the bottom. Carefully pour out the water, saving the starch. Add the starch and salt to the grated potato along with the optional garlic chives. Mix well."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a skillet with two tablespoons of oil over medium heat. Add 1/2 of the batter, and spread it evenly into a round shape. You can make smaller pancakes if you like. Reduce the heat to medium to medium low, and cook until the bottom is light golden brown, about 2 to 3 minutes on each side. Repeat the process with the remaining batter. Serve hot with a dipping sauce."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "If you have potatoes, you can make this crispy, chewy Korean potato pancake. Other vegetables are nice to have but not necessary. Enjoy gamjajeon as a"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 17,
        "name": "Nokdujeon (Mung Bean Pancakes)",
        "image": "images/recipe_17_nokdujeon_mung_bean_pancakes_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2cupsdried peeled and split mung beans*yields about 4 cups soaked",
            "▢8ouncessukju namul (mung bean sprouts)",
            "▢8ounceskimchi",
            "▢6 - 8scallions",
            "▢4ouncespork , ground or finely chopped",
            "▢2teaspoonssoy sauce",
            "▢1teaspoongarlic",
            "▢1tablespoonsesame oil",
            "▢salt",
            "▢vegetable oil for pan frying",
            "▢2tablespoonssoy sauce",
            "▢1tablespoonvinegar(or to taste)",
            "▢2tablespoonswater",
            "▢pinchof black pepper",
            "▢pinchof red pepper flakesgochugaru - optional"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse and soak the mung beans in water for 3 - 4 hours. Drain."
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, cook the mung bean sprouts in boiling water for about 2 minutes (you can skip this blanching if preferred). Rinse in cold water to stop cooking. Drain and gently squeeze out excess water. Thinly slice the kimchi and scallions. In a large bowl, combine the kimchi, bean sprouts, scallions, meat, soy sauce, sesame oil and garlic. Mix well."
            },
            {
                "@type": "HowToStep",
                "text": "In a blender, grind 2 cups of the soaked beans in 3/4 cup of cold water with 1/2 teaspoon of salt until it has a coarse, sandlike consistency."
            },
            {
                "@type": "HowToStep",
                "text": "Add to the vegetable and meat mixture. Repeat with the remaining beans. Gently mix the mung bean batter until the ingredients are evenly distributed."
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons or more of oil in a non-stick pan over medium to medium high heat. (See note.) Ladle the mixture into the pan and spread it evenly into a thin round shape. Cook until the bottom is golden brown (2 - 3 minutes), and turn it over, adding more oil. Press it down with a spatula, and cook for another 2- 3 minutes. Repeat the process with the rest of the mixture."
            },
            {
                "@type": "HowToStep",
                "text": "Serve hot off the pan with a dipping sauce."
            }
        ],
        "recipeYield": "Servings:10",
        "prepTime": "PTPrep Time:20minutesminutes",
        "cookTime": "PTCook Time:25minutesminutes",
        "description": "Nokdujeon (or nokdu bindaetteok), is a type of savory Korean pancake made with ground mung beans. The result is crispy golden brown pancakes that are savory and nutty with some crunch from the vegetables."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 18,
        "name": "Glazed Korean Meatballs (Wanja Jorim)",
        "image": "images/recipe_18_glazed_korean_meatballs_wanja_jorim_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1/2poundground beef",
            "▢1/2poundground pork",
            "▢4 to 5fresh shiitakeor any mushroom caps, finely chopped",
            "▢1/4medium onionfinely chopped",
            "▢2scallionsfinely chopped",
            "▢1egg yolk",
            "▢1tablespoonsoy sauce",
            "▢2teaspoonsminced garlic",
            "▢1teaspoonfinely grated ginger",
            "▢saltabout 1/4 teaspoon and pepper to taste",
            "▢1/2cupcornstarch or flour for dredging",
            "▢1tablespoonsugar",
            "▢3tablespoonssoy sauceYou can replace with 1 TB gochujang for a little spicy kick",
            "▢3tablespoonsrice wineor mirin",
            "▢3tablespoonswater",
            "▢2tablespoonscorn syrupoligodang",
            "▢2plump garlic clovesthinly sliced",
            "▢1inchpiece gingerthinly sliced",
            "▢chopped peanuts or pine nuts",
            "▢chopped scallion"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Finely chop the mushrooms, onion, and scallions. Combine all the meatball ingredients well by hand until evenly blended."
            },
            {
                "@type": "HowToStep",
                "text": "Shape the mixture into about 1 1/4-inch balls. Dredge the meatballs in the cornstarch or flour to lightly coat."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a tablespoon of oil in a pan over medium heat. Add half of the meatballs to the pan. Turning as necessary, fry until all sides are golden brown but not cooked through, about 5 minutes. The meatballs will finish cooking in the sauce. Remove from the pan and repeat with the remaining meatballs."
            },
            {
                "@type": "HowToStep",
                "text": "Add all the sauce ingredients to another pan. Boil over medium heat until the sauce is slightly thickened, about 3 – 4 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Add the meatballs to the sauce and simmer until the sauce becomes a thick glaze, turning to coat evenly, about 5 minutes. Sprinkle with the optional garnish. Serve warm with your choice of vegetables."
            }
        ],
        "recipeYield": "Servings:3",
        "prepTime": "PTPrep Time:30minutesminutes",
        "cookTime": "PTCook Time:15minutesminutes",
        "description": "These Korean-style meatballs are glazed in a sweet and savory sauce. They are tender, moist and packed with lots of flavors!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 19,
        "name": "Haemul Pajeon (Seafood Scallion Pancake)",
        "image": "images/recipe_19_haemul_pajeon_seafood_scallion_pancake_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1-1/2 to 2cupsassortment of seafoodsquid, shrimp, mussels, oysters, clams, etc., cut into bite sizes",
            "▢1tablespoonsesame oil",
            "▢1 or 2bunches scallions",
            "▢1red chili pepper - optional",
            "▢1egglightly beaten - optional",
            "▢1cupKorean pancake mix, buchim garu, 부침가루(or all purpose flour or gluten free flour with 1/2 teaspoon salt - See note)",
            "▢1tablespoonsoy sauce",
            "▢2 to 3teaspoonsvinegar",
            "▢1tablespoonwater",
            "▢pinchof black pepper",
            "▢pinchof gochugaruKorean red chili pepper flakes",
            "▢1/2teaspoonsugar - optional",
            "▢1tablespoonchopped scallion - optional",
            "▢1tablespoonDiced onion - optional"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare the seafood, scallions and optional pepper, draining excess water. (Wet ingredients will make pajeon soggy.) Cut the scallions in half crosswise. Cut the white part of the scallions lengthwise if thick. Mix the seafood with the sesame oil."
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix the pancake mix with 3/4 cup icy cold water. You may need a couple more tablespoons but add one tablespoon at a time. The batter should be thinner than a Western breakfast pancake batter and thicker than a crepe batter. (For a crispy pajeon, the batter should be relatively thin.) Mix in 1/2 of the seafood."
            },
            {
                "@type": "HowToStep",
                "text": "Heat 3 to 4 tablespoons of vegetable oil in a non-stick pan over medium high heat, ladle 1/2 of the mixture into the pan and spread it evenly into a thin round shape."
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the scallions in a single layer on top of the batter, pressing them down into the batter. Add 1/2 of the remaining seafood and a few slices of the optional pepper."
            },
            {
                "@type": "HowToStep",
                "text": "Spoon one half of the optional lightly beaten egg on top. Cook until the bottom is golden brown (3 – 4 minutes). Reduce the heat to medium if the pancake is browning too fast."
            },
            {
                "@type": "HowToStep",
                "text": "Turn it over, adding more oil (2 to 3 tablespoons) around the edges. Cook for another 3 – 4 minutes. Repeat the process with the remaining batter and ingredients. Serve hot off the pan with dipping sauce."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the scallions shorter, 2 to 3-inch lengths. You can mix everything with the batter, except the egg. Drizzle the egg over on top, and follow the direction above for pan-frying."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:20minutesminutes",
        "description": "Haemul pajeon is a popular Korean savory pancake made with scallions and seafood. Enjoy your restaurant favorite at home with this easy recipe!  "
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 20,
        "name": "Gyeran Mari (Rolled Omelette)",
        "image": "images/recipe_20_gyeran_mari_rolled_omelette_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢3large eggsYou can use 5 or more eggs for thicker rolls",
            "▢1or 1.5 tablespoons finely chopped scallion",
            "▢1or 1.5 tablespoons finely chopped carrot",
            "▢Salt to tasteabout ⅛",
            "▢Pinchblack pepper",
            "▢vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Finely chop the scallion and carrot."
            },
            {
                "@type": "HowToStep",
                "text": "Crack and beat the eggs, in a bowl with a spoon, a fork, or a pair of chopsticks until the yolks and whites are blended well with no visible strings of whites. Stir in salt and pepper."
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the chopped vegetables."
            },
            {
                "@type": "HowToStep",
                "text": "Add a teaspoon of vegetable oil to a medium size non-stick pan and distribute the oil evenly using a napkin or paper towel. Preheat over medium low heat, until it feels hot when you place your hand 2 to 3 inches above the bottom of the pan."
            },
            {
                "@type": "HowToStep",
                "text": "Add 1/2 of the egg mixture to the pan. Swirl it around to cover the pan. Let it cook until the top begins to set but is still wet."
            },
            {
                "@type": "HowToStep",
                "text": "Using a spatula, lift one end of the egg (about 1-1/2 inches) and fold it over to the other side. Reduce the heat or raise the pan away from the heat for a little while if the bottom is browning."
            },
            {
                "@type": "HowToStep",
                "text": "Lift the folded part and fold it again. Pull the egg to the rolled side, making room on the round end for more egg mixture. Add 1/2 of the remaining egg and spread to cover the open space."
            },
            {
                "@type": "HowToStep",
                "text": "When the egg addition is set, lift the folded part and fold it again. Pull the egg to the rolled side and repeat the process with the remaining egg to make an about 2-inch egg log."
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the pan and let cool for about 5 minutes. Slice the egg into thick, even pieces (3/4 to 1-inch thick)."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:5minutesminutes",
        "description": "This rolled egg recipe is made with chopped carrot and scallion. It’s a popular side dish, especially for a lunch box, that you can easily whip up in no Gyeran mari is Korean-style rolled omelette. It’s a popular side dish, especially for a lunch box, that's easy to whip up in no time!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 21,
        "name": "Shrimp Salad with Hot Mustard Dressing (Saewu Naengchae)",
        "image": "images/recipe_21_shrimp_salad_with_hot_mustard_dressing_saewu_naengchae_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2teaspoonshot mustard powder (gyeoja, 겨자)If using prepared paste, use 1 tablespoon and add 1 tablespoon water to thin it.",
            "▢1tablespoonvinegar",
            "▢1teaspoonsoy sauce",
            "▢2teaspoonssugar",
            "▢1/2teaspoonminced garlic",
            "▢⅛teaspoonsalt",
            "▢2Kirby (pickling) cucumbers (or 1 Korean cucumber)",
            "▢1/2Korean pear",
            "▢radish sprouts for garnishoptional",
            "▢1/4lemon",
            "▢Optional vegetables:",
            "▢1/4red bell pepper",
            "▢1/4orange bell pepper",
            "▢10large shrimp21-25 counts, shelled and deveined (more if using smaller shrimp)",
            "▢1/4lemon",
            "▢1teaspoonsalt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the mustard with 1 tablespoon of warm water. Set it aside for 5 to 10 minutes. Add the remaining dressing ingredients and mix well. Refrigerate while preparing the other ingredients."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the cucumbers and pear into thin slices"
            },
            {
                "@type": "HowToStep",
                "text": "OR if using optional bell peppers, julienne the fruit and vegetables."
            },
            {
                "@type": "HowToStep",
                "text": "Have a bowl of ice water ready near the stove top. Bring a small pot of water (4 cupto a gentle boil over medium heat. Add salt, lemon and shrimp and simmer uncovered until the shrimp turn opaque and curl, about 40 seconds. Remove immediately and plunge them into the ice water to stop cooking and chill. Drain."
            },
            {
                "@type": "HowToStep",
                "text": "Remove immediately and plunge them into the ice water to stop cooking and chill. Drain. Cut each shrimp in half lengthwise, if desired."
            },
            {
                "@type": "HowToStep",
                "text": "Nicely arrange the cucumber, pear and shrimp (or optional julienned vegetables and pear) on a plate. Spoon the dressing over, or serve it on the side. Garnish with optional radish sprouts and/or lemon."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:5minutesminutes",
        "description": "This simple and refreshing shrimp salad is packed with flavors and heat! Perfect as an elegant starter, a side dish or a light meal!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 22,
        "name": "Chicken Salad with Pine Nut Dressing",
        "image": "images/recipe_22_chicken_salad_with_pine_nut_dressing.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢4tablespoonspine nuts",
            "▢1tablespoonrice wine vinegaror any clear vinegar",
            "▢1tablespoonlemon juice",
            "▢2tablespoonswater",
            "▢1teaspoonhot mustard paste – gyeoja, 겨or dijon or yellow mustard if desired",
            "▢1tablespoonsugar",
            "▢1/2teaspoonminced garlic",
            "▢salt to tasteabout 1/2 teaspoon",
            "▢1chicken breast8 to 10 ounces",
            "▢1/4medium onion",
            "▢1/2stalk celery",
            "▢1/2carrot",
            "▢3garlic cloves",
            "▢1bay leaf - optional",
            "▢a handful spring mix or other salad vegetables of choice",
            "▢2 to 3red radishesthinly sliced",
            "▢1/4red bell pepperjulienned",
            "▢1/4yellow bell pepperjulienned",
            "▢1small Kirby cucumbercut lengthwise and then thinly sliced diagonally"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the dressing, toast the pine nuts in a pan over medium heat for 2-3 minutes. This will enhance the flavor. Grind the pine nuts in a blender or food processor (or finely mince them with a knife). Add the remaining dressing ingredients and blend well. Refrigerate while preparing the chicken and vegetables."
            },
            {
                "@type": "HowToStep",
                "text": "In a medium size pot, bring 5 cups of water and the aromatic vegetables to a simmer over medium heat. Add the chicken breast and simmer over medium low heat for about 8 -10 minutes (increase the time if cooking more than 1 chicken breast). Remove the chicken and allow it to cool."
            },
            {
                "@type": "HowToStep",
                "text": "When cool enough to handle, shred and lightly season with salt. Refrigerate while preparing vegetables. Wash salad vegetables in ice water and drain well. Cut them into desired sizes if needed."
            },
            {
                "@type": "HowToStep",
                "text": "Combine the shredded chicken with the dressing, leaving a couple of tablespoons of dressing."
            },
            {
                "@type": "HowToStep",
                "text": "Line the platter with the salad vegetables. Place the chicken salad in the middle. Drizzle with the remaining dressing, and garnish with a few pine nuts if available."
            },
            {
                "@type": "HowToStep",
                "text": "OR thinly slice the optional vegetables and mix well with the chicken salad before serving."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:15minutesminutes",
        "description": "This Korean chicken salad recipe is made with breast meat and a pine nut dressing! It’s a healthy dish you can easily make for a quick lunch."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 23,
        "name": "Kimchi Mandu (Kimchi Dumplings)",
        "image": "images/recipe_23_kimchi_mandu_kimchi_dumplings_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢Makes about 40 dumplings",
            "▢40dumpling wrappersslightly thick",
            "▢2ouncesdangmyeonsweet potato starch noodles, soaked in warm water for about 30 min.",
            "▢1cuppacked finely chopped kimchi",
            "▢8ouncestofu",
            "▢10ouncesmung bean sprouts, sukju namul (숙주나물)",
            "▢1/2medium onion",
            "▢2 to 3scallions",
            "▢8ouncesground pork or beef (or mix)",
            "▢1tablespoonminced garlic",
            "▢1teaspoonfinely grated ginger or juiced",
            "▢1tablespoonsesame oil",
            "▢1tablespoonsoy sauce",
            "▢1tablespoongochugaru (adjust to taste)",
            "▢salt to tasteabout 1/4 teaspoon",
            "▢pepper to tasteabout ⅛ teaspoon",
            "▢1tablespoonPerilla seed oil (in lieu of sesame oil)",
            "▢2 to 4tablespoonsground perilla seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Finely chop the kimchi and squeeze out excess liquid by hand."
            },
            {
                "@type": "HowToStep",
                "text": "Blanch the bean sprouts in boiling water, drain, chop and squeeze out water."
            },
            {
                "@type": "HowToStep",
                "text": "Squeeze out water from the tofu. Using a cheesecloth will make squeezing easier. Finely chop the noodles. Finely chop the onion and squeeze out water. Finely chop the scallions."
            },
            {
                "@type": "HowToStep",
                "text": "Combine all the filling ingredients in a large bowl. Mix well by hand."
            },
            {
                "@type": "HowToStep",
                "text": "Place one heaping teaspoonful to a tablespoon of the filling on a wrapper. Wet the edges of the wrapper with water or egg wash and seal tightly (pushing the air out with your fingers) into a half-moon shape. (Stop here if you want a half-moon shape dumpling.) Then, bring the two ends together, apply water or egg wash to one end and press tightly to create a round shape. Repeat this process until all the filling/wrappers are used."
            },
            {
                "@type": "HowToStep",
                "text": "Kimchi mandu can be steamed for about 10 minutes in a steamer (12 minutes if frozen). Make sure to line the steamer with a wet cheesecloth, paper towel, or cabbage leaves to prevent mandu from sticking."
            },
            {
                "@type": "HowToStep",
                "text": "For boiling, pan-frying and deep-frying dumplings, see my other mandurecipe."
            }
        ],
        "recipeYield": "Servings:35dumplings",
        "prepTime": null,
        "cookTime": null,
        "description": "These Korean dumplings filled with a kimchi mixture are highly popular in Korea. Kimchi adds tons of spicy and savory flavors to the dumplings."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 24,
        "name": "Tangsuyuk (Sweet and Sour Beef or Pork)",
        "image": "images/recipe_24_tangsuyuk_sweet_and_sour_beef_or_pork_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢10ouncestender cut of pork or beef (such as pork loin or beef sirloin)",
            "▢salt and pepper",
            "▢1/2teaspoongrated ginger",
            "▢1cuppotato starchor corn starch, soaked in 1 cup of water for 2 to 3 hours",
            "▢2tablespoonslightly beaten egg",
            "▢1tablespooncanola oil",
            "▢4cupscanola or vegetable oil for deep frying",
            "▢1/2small carrot",
            "▢1/4small onion",
            "▢1 ouncewood ear mushrooms - optional",
            "▢1/2small cucumberor 1/4 green bell pepper",
            "▢1cupwater",
            "▢1tablespoonsoy sauce",
            "▢4tablespoonssugar",
            "▢2tablespoonsvinegar (or to taste)",
            "▢pinchsalt",
            "▢Starch slurry – 2 tablespoons starch* in 4 tablespoons water",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonwater",
            "▢1teaspoonvinegar",
            "▢pinchblack pepper",
            "▢pinchred chili pepper flakesgochugaru"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "At least an hour before cooking this dish, combine 1 cup of the starch with 1 cup of water and refrigerate until ready to use. The starch and water will separate, and you will need to pour out the water on top to use the soaked starch at the bottom."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the beef (or pork) into 2 to 2.5-inch long strips (about 3/4-inch wide and ⅛ - inch thick). Mix well with the grated ginger, and lightly sprinkle with salt and pepper. Let it sit until ready to deep fry."
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the vegetables by cutting into thin bite size pieces."
            },
            {
                "@type": "HowToStep",
                "text": "In a pan, add 1 cup of water along with the remaining sauce ingredients except the starch slurry. Boil just until the sugar melts and turn off the heat. You will finish the sauce when the meat has been deep fried."
            },
            {
                "@type": "HowToStep",
                "text": "Carefully pour out the soaking water from the starch. Use your hand to mix the soaked starch with the egg and oil. The starch will be very stiff. The addition of oil will help loosen it a little."
            },
            {
                "@type": "HowToStep",
                "text": "Coat the meat with the starch batter."
            },
            {
                "@type": "HowToStep",
                "text": "Add 4 cups of oil to a deep fryer, wok or large pot. Heat over high heat to 350°F. Using metal tongs or chopsticks, drop the meat in the oil one piece at a time. Do not crowd the oil. Cook until golden brown, about 3 minutes, in two or three batches, reheating the oil to 350°F between the batches."
            },
            {
                "@type": "HowToStep",
                "text": "Remove them with a wire skimmer or a slotted spoon. Drain on a wire rack or in a large mesh strainer set on a bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Reheat the oil to 350°F. Add the meat (you can do this in one batch for the second frying) and deep fry again for 2 to 3 minute. Drain on a wire rack or in a large mesh strainer set on a bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Bring the sauce to a boil again. Add the carrot, onion, and optional mushrooms, which take slightly longer to cook than the green vegetable. When the sauce boils, add the starch slurry, stirring well. Taste the sauce and add a little more sugar or vinegar if desired. Turn the heat off, and then add the cucumber slices (or green pepper if using). The green vegetables lose their color quickly if boiled in the sauce."
            },
            {
                "@type": "HowToStep",
                "text": "Place the meat on a large serving plate and pour the tangsuyuk sauce on top or serve the sauce on the side. Serve immediately with the optional dipping sauce."
            }
        ],
        "recipeYield": "Servings:3",
        "prepTime": "PTPrep Time:20minutesminutes",
        "cookTime": "PTCook Time:15minutesminutes",
        "description": "Tangsuyuk is a Chinese sweet and sour pork dish adapted for Korean taste. It can also be made with beef."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 25,
        "name": "Mandu (Korean Dumplings)",
        "image": "images/recipe_25_mandu_korean_dumplings_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1package dumpling skins/wrappers (about 40 pieces), 만두피 (mandu pi)",
            "▢8ounceszucchinifinely chopped",
            "▢10ouncesgreen cabbagefinely chopped",
            "▢4ouncesfresh mushroomsfinely chopped (shiitaki preferably)",
            "▢1/2medium onionfinely chopped",
            "▢2scallionsfinely chopped",
            "▢1/2poundground porkor other meat if preferred",
            "▢1/4poundground beef",
            "▢1tablespoonminced garlic",
            "▢1 to 2teaspoonsfinely minced gingeror juiced",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonsesame oil",
            "▢1egg",
            "▢1/4teaspoonsalt to season the filling and more for salting vegetables",
            "▢⅛teaspoonpepper",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchof black pepper",
            "▢pinchof red pepper flakesgochugaru"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Finely chop zucchini and cabbage."
            },
            {
                "@type": "HowToStep",
                "text": "In two separate bowls, generously sprinkle salt over the chopped zucchini and cabbage and set aside (for at least 15 minutes) while preparing other ingredients. (This process will draw out water, soften the texture, and add flavor.) Squeeze out as much water as possible from the salted zucchini and cabbage by hand. Transfer to a large mixing bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Prepare all the remaining ingredients and add to the mixing bowl. Mix all ingredients well with your hand."
            },
            {
                "@type": "HowToStep",
                "text": "Place one heaping teaspoonful of the filling on a wrapper. Wet the edges of the wrapper with water and seal tightly (pushing the air out with your fingers) into a half-moon shape. Repeat this process until all the filling/wrappers are used."
            },
            {
                "@type": "HowToStep",
                "text": "Heat the pan with 2 tablespoons of vegetable oil over medium high heat. Add the dumplings, making sure they aren’t touching each other. Fry for 1 – 2 minutes, until the bottoms are golden brown. Add 1/3 cup of water to the pan, and cover immediately with a lid. Reduce the heat to medium low, and steam for 4 to 5 minutes. Or cook 2 - 3 minutes on each side over medium heat until golden brown without adding water. If the dumplings are frozen, cook a little longer."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a deep fryer or skillet with about 2-3 inches of canola or vegetable oil over medium-high heat to 350°F. Fry the dumplings for 2-3 minutes until golden brown."
            },
            {
                "@type": "HowToStep",
                "text": "Steam the dumplings for about 10 minutes in a steamer (12 minutes if frozen). Make sure to line the steamer with a wet cheesecloth or cabbage leaves to prevent the mandu from sticking."
            },
            {
                "@type": "HowToStep",
                "text": "Bring a pot of water to a boil. Add mandu (stirring gently so they don’t stick to the bottom of the pot) a few at a time, and cook until all of them come up to the surface. Continue to cook for another minute or two."
            }
        ],
        "recipeYield": "Servings:8",
        "prepTime": null,
        "cookTime": null,
        "description": "Learn how to make Korean dumplings (mandu) with this easy to follow recipe! They are so delicious and versatile! Dumplings are much easier than you think!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 26,
        "name": "Dubu Kimchi (Tofu with Stir-fried Kimchi and Pork)",
        "image": "images/recipe_26_dubu_kimchi_tofu_with_stir_fried_kimchi_and_pork_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2cupsfully fermented kimchi",
            "▢1/2poundthinly sliced pork or pork belly",
            "▢1/2onion",
            "▢2scallions",
            "▢1teaspoongrated ginger",
            "▢1tablespoonminced garlic",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonsugar",
            "▢1tablespoonsesame oil",
            "▢2 - 3tablespoonsgochujang (고추장), Korean red chili pepper paste",
            "▢1teaspoonsesame seeds",
            "▢pinchpepper",
            "▢1 18-ozpackage tofu"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut kimchi and pork into bite sizes. Thinly slice onion and scallions. In a large bowl, combine kimchi, pork, onion, scallions and the remaining ingredients and mix well. Let it stand for 15 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "In a medium size pot, bring about 4 cups of water to a boil. Cut the tofu into two blocks. Reduce the heat to medium high, and add the tofu. Gently boil for 5 minutes. Carefully transfer the tofu to a colander to drain. Cut each block into about 1/2-inch thick slices."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large pan over medium high heat and add the kimchi and pork mix. Cook until the kimchi becomes soft, the pork is cooked through, and most of the liquid generated during the cooking process is evaporated, about 5 - 6 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the tofu slices nicely on a plate leaving an open space in the middle part. Place the stir-fried kimchi and pork in the middle and serve. Or, you can serve the stir-fried kimchi and tofu side by side."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "Kimchi is stir-fried with pork and served with sliced tofu that has been either boiled or pan-fried. Dubu kimchi is a popular drinking snack in Korea."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 27,
        "name": "Tteokbokki (Spicy Stir-fried Rice Cakes)",
        "image": "images/recipe_27_tteokbokki_spicy_stir_fried_rice_cakes_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundtteokbokki tteok 떡볶이 떡 (about 24 3-inch long rice cake pieces)See Note 1",
            "▢1-2eomuk 어묵 (fish cake) sheets",
            "▢4ouncesgreen cabbage (yangbaechu, 양배추)",
            "▢1-2or scallions",
            "▢1tablespoonminced garlic",
            "▢8-10medium to large dried anchovies (마른멸치), about 0.5 ounces (15 grams)Or simply use abroth packet.",
            "▢1piece dasima (dried kelp), about 3-inch square",
            "▢1/4medium onion, roughly sliced",
            "▢3cupsanchovy brothor water (use 4 cups for more sauce)",
            "▢3tablespoonsgochujang, 고추장See Note 2",
            "▢1-3teaspoonsgochugaru, 고추가루See Note 3",
            "▢1tablespoonsoy sauce",
            "▢2tablespoonssugar (use 1 tablespoon for less sweet tteokbokki)",
            "▢1tablespooncorn syrup (or oligo syrup) - use more sugar if not using",
            "▢2boiled eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the rice cakes for about 20 minutes (can be longer for refrigerated rice cakes)."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the fish cake, cabbage, and scallions into about 2-inch long pieces."
            },
            {
                "@type": "HowToStep",
                "text": "To a large pan, add the dried anchovies, dried kelp, and onion along with 5 cups of water. Bring it to a boil over medium high heat, and continue to boil for 10 minutes. Reduce it close to medium if your heat is very high. Remove the anchovies, dasima and onion from the broth."
            },
            {
                "@type": "HowToStep",
                "text": "Add the sauce ingredients to the pan, stirring to dissolve the red chili pepper paste (gochujang)."
            },
            {
                "@type": "HowToStep",
                "text": "Add the rice cakes. Boil until the rice cakes become very soft and the sauce is thickened, about 8 - 10 minutes. This can take longer, depending on your rice cakes. Stir frequently so the rice cakes don't stick to the bottom of the pan."
            },
            {
                "@type": "HowToStep",
                "text": "Drop the vegetables, garlic, and fish cakes in. Continue to boil, stirring occasionally, for an additional 4 - 6 minutes. Depending on rice cakes, you may need more time to reach a desired level of softness. Add more broth or water as necessary. Drop in the scallions and boiled eggs with 2 to 3 minutes remaining. Taste the sauce, and adjust the seasoning if needed. Serve hot."
            }
        ],
        "recipeYield": "Servings:3",
        "prepTime": "PTPrep Time:20minutesminutes",
        "cookTime": "PTCook Time:20minutesminutes",
        "description": "This Korean spicy rice cake dish is No. 1 street food in Korea. Make it at home with this easy tteokbokki recipe! Simply addictive!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 28,
        "name": "Hobak Buchim (Zucchini Pancakes)",
        "image": "images/recipe_28_hobak_buchim_zucchini_pancakes_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1medium zucchiniabout 8 ounces",
            "▢1/2teaspoonsalt",
            "▢1/4medium sweet onion, thinly sliced",
            "▢2green or red chili peppers, thinly sliced -- optionalSee note 1",
            "▢1/2cupbuchim garu (Korean savory pancake mix)or flour (See note 2)",
            "▢1large egg - optional (omit for a vegan version)If not using, add some water",
            "▢vegetable or canola oil for frying",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchof black pepper",
            "▢pinchgochugaru (Korean red chili pepper flakes)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the zucchini into matchsticks. Place them in a bowl, and sprinkle with 1/2 teaspoon of salt. Let sit for about 10 minutes until wilted and released some liquid. Squeeze the liquid out from the zucchini as much as possible, reserving the liquid in the bowl. Set the zucchini aside in another bowl or plate."
            },
            {
                "@type": "HowToStep",
                "text": "Add the optional egg and pancake mix (or flour) to the bowl with the liquid from squeezing zucchini. If not using an egg, add a couple of tablespoons of water. Mix the batter well with a spoon. Do not over mix. A little lumps are fine. Then, combine with the zucchini, onion and chili peppers. The zucchini mix may look stiff when mixing, but it will become more liquidly after a few minutes. If it’s still too stiff, mix in some water (2 to 3 tablespoons to start with)."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a skillet with two tablespoons of oil over medium high heat. Add about 2 heaping tablespoons of the batter and spread it evenly into a thin round shape. You can also add more batter to make it a large pancake, if preferred (see note 3). Depending on the size of your pan, you can cook 3 to 4 pancakes at once. Reduce the heat to medium, and cook until the bottom is light golden brown, about 2 minutes on each side. Repeat the process with the remaining batter. Serve hot with a dipping sauce."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "These Korean savory pancakes, hobak buchim, are quick and easy and so delicious with summer zucchini as a snack, an appetizer, or a light vegan meal!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 29,
        "name": "Eomuk Guk (Fish Cake Soup)",
        "image": "images/recipe_29_eomuk_guk_fish_cake_soup_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢12ounceseomukfish cake",
            "▢8ouncesKorean radishmu",
            "▢1teaspoonminced garlic",
            "▢1/2tablespoonsoy sauce",
            "▢1/2tablespoonsoup soy sauce",
            "▢1scallionroughly chopped",
            "▢salt and pepper to taste",
            "▢8cupsanchovy brothmade with 1 optional dried or red chili pepper - Seeanchovy brothfor the recipe."
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Make 8 cups of anchovy broth with the optional chili pepper."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the fish cakes into bite size pieces."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the radish into about 1 to 1-1/2 inch-thin squares."
            },
            {
                "@type": "HowToStep",
                "text": "Quickly blanch the fish cakes in boiling water to remove excess oil, and then drain."
            },
            {
                "@type": "HowToStep",
                "text": "Add the radish slices to the broth, and boil until translucent and soft, about 5 minutes. Add the garlic, and season with the soy sauce."
            },
            {
                "@type": "HowToStep",
                "text": "Drop the fish cake in, and boil for a few more minutes. Add salt and pepper to taste. Drop the scallion in before turning off the heat."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "When it’s cold outside, skewered eomuk (어묵) simmered in a light savory broth is hugely popular at street food carts and stalls in Korea. At home, eomuk guk (fish cake soup) can be prepared without skewers as an easy everyday soup! Such a comfort food!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 30,
        "name": "Crispy Guljeon (Korean-style Oyster Fritters)",
        "image": "images/recipe_30_crispy_guljeon_korean_style_oyster_fritters_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢Makes 7 to 9 about 3-inch fritters",
            "▢8ouncesoystersgul, 굴",
            "▢½small carrot",
            "▢1scallion",
            "▢2mushroom capsany fresh mushrooms",
            "▢1cupbuchim garuready-made pancake mix or flour (see note)",
            "▢1tablespooncorn or potato starch",
            "▢1/4teaspoonbaking soda",
            "▢1teaspoonsesame oil",
            "▢oil for frying",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchof black pepper",
            "▢pinchof gochugaruKorean red chili pepper flakes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Clean the oysters by gently swishing them around in salted water. Drain. Rinse again in clean water and keep them in a strainer over a bowl to drain well."
            },
            {
                "@type": "HowToStep",
                "text": "Finely chop the carrot, scallion, and mushrooms."
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the pancake mix, starch and baking soda and whisk well. Mix with 3/4 cup icy cold water. Add a tablespoon or two more if needed. The batter should be slightly thick but still runny."
            },
            {
                "@type": "HowToStep",
                "text": "Mix the oyster with the sesame oil, and then add to the batter along with the vegetables."
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1/4-inch oil in a non-stick pan over medium high heat. Add about 2 heaping tablespoons of the batter, and spread it evenly into a small round shape. Depending on the size of your pan, you can cook 5 to 6 pancakes at once. Cook until the bottom is golden brown, about 2 minutes on each side. Repeat the process with the remaining batter. Serve hot with a dipping sauce."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "These Korean-style oyster fritters are made with the typical Korean savory pancake batter, loaded with oysters, and fried to perfection! Crispy outside, delicately soft inside!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 31,
        "name": "Spicy Seafood Japchae",
        "image": "images/recipe_31_spicy_seafood_japchae.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢4ouncesdangmyeon당면 (Korean sweet potato starch noodles)",
            "▢1tablespoonvegetable or canola oil",
            "▢1tablespoonsesame oil",
            "▢1/2 to 1tablespoongochugarupreferably finely ground - see note",
            "▢1small squidabout 4 ounces",
            "▢8small shrimppeeled and deveined",
            "▢1/4medium onionthinly sliced",
            "▢⅓small carrotcut into matchsticks",
            "▢2 to 3fresh shiitake mushroomsor mushrooms of your choice, thinly sliced",
            "▢2ouncesenoki mushrooms - optional",
            "▢1scallionsliced diagonally",
            "▢Salt and pepper",
            "▢2tablespoonssoy sauce",
            "▢1-1/2tablespoonssugar",
            "▢2teaspoonsminced garlic",
            "▢1tablespoonsesame oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the noodles in warm water until soft (about 30 to 40 minutes), and drain."
            },
            {
                "@type": "HowToStep",
                "text": "Clean the shrimp and squid. Cut the squid into bite size pieces."
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the vegetables, and mix all the sauce ingredients in a small bowl."
            },
            {
                "@type": "HowToStep",
                "text": "Add the vegetable oil, sesame oil, and the gochugaru to a pan, and heat until hot over medium low heat, stirring. Remove from the heat as soon as the oil starts to turn red and the chili pepper flakes become a bit pasty. Do not burn the gochugaru."
            },
            {
                "@type": "HowToStep",
                "text": "Turn the heat to medium, and add the noodles to the pan along with 1-1/2 tablespoons of the prepared sauce. Stir-fry until the noodles are soft, 3 to 4 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Remove the noodles onto a plate. In the same pan, stir fry the onion for a minute, and then carrot and mushrooms until wilted. Add a tablespoon of water if the vegetables look dry. Lightly season with salt and pepper."
            },
            {
                "@type": "HowToStep",
                "text": "Add the seafood and the remaining sauce, and stir-fry until the seafood is cooked through. Follow this by the scallion and optional enoki mushrooms until the scallions are slightly wilted."
            },
            {
                "@type": "HowToStep",
                "text": "Return the noodles to the pan, and toss everything well together. You can add a bit more sugar and/or soy sauce to taste."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": null,
        "cookTime": null,
        "description": "This recipe is another variation of japchae, Korean stir-fried glass noodles! The japchae is made spicy with seafood. It has a nice and clean spicy kick!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 32,
        "name": "Seafood Cheese Tteokbokki (Spicy Rice Cake)",
        "image": "images/recipe_32_seafood_cheese_tteokbokki_spicy_rice_cake_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundtteokbokki tteok떡볶이 떡",
            "▢1small piece dashima (about 3 inch square), dried kelp",
            "▢6small shrimpsave shells if peeling",
            "▢1/2small squid",
            "▢3ouncesgreen cabbage (yangbaechu, 양배추)",
            "▢1scallion",
            "▢1/2cupmozzarella cheese (or pizza blend)Use more if desired",
            "▢1tablespoongochujang, 고추장 (Korean red chili pepper paste)",
            "▢1tablespoonsgochugaru, 고추가루  (Korean red chili pepper flakes)adjust to taste - see note",
            "▢1.5tablespoonssoy sauce",
            "▢1tablespoonsugar",
            "▢1tablespooncorn syrup or oligo syrupor use more sugar (about ⅔ tablespoon)",
            "▢2teaspoonsminced garlic"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the rice cakes for about 20 minutes if hardened or refrigerated."
            },
            {
                "@type": "HowToStep",
                "text": "Clean the shrimp (saving the shells if peeling) and squid, and cut the squid into small pieces. Cut the cabbage and scallions into about 2-inch long pieces."
            },
            {
                "@type": "HowToStep",
                "text": "Add 2 cups of water, dashima, and shrimp shells, if available, to a pan. Bring it to a boil, and continue to boil for 5 minutes. Remove the dashima and shrimp shells. Preheat the oven broiler if you want to use it to melt the cheese."
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the sauce ingredients. Bring it to a boil over medium high heat, stirring to dissolve the sauce mix. Add the rice cakes. Boil until the rice cakes become very soft and the sauce is thickened, about 8 - 10 minutes. Stir frequently so the rice cakes don't stick to the bottom of the pan."
            },
            {
                "@type": "HowToStep",
                "text": "Add the cabbage. Continue to cook, stirring constantly, for an additional 2 - 4 minutes. Taste the sauce, and adjust the seasoning if needed."
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the seafood and scallion, and continue to cook, stirring, until the seafood is almost cooked."
            },
            {
                "@type": "HowToStep",
                "text": "Add the cheese on top. You can melt the cheese over the stove top, covered, or in the microwave, or under the oven broiler."
            }
        ],
        "recipeYield": "Servings:3",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:30minutesminutes",
        "description": "A modern twist of Korean spicy rice cake (tteokbokki)! This tteokbokki recipe is made with seafood and cheese. So flavorful and comforting!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 33,
        "name": "Soupy Tteokbokki (Spicy Braised Rice Cake)",
        "image": "images/recipe_33_soupy_tteokbokki_spicy_braised_rice_cake_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundtteokbokki tteok떡볶이떡 (2 to 3-inch long rice cake pieces or oval shapes)",
            "▢8ouncesnapa cabbageor green cabbage",
            "▢2sheets eomuk어묵, (fish cakes - aka oden)",
            "▢2scallions",
            "▢1/4onion",
            "▢2soft boiled eggs - optional",
            "▢1/2of 1 package raw ramen noodles - optional",
            "▢5 to 6cupsanchovy broth",
            "▢3tablespoonsgochugaru고추가루, Korean red chili pepper flakes, preferably finely ground",
            "▢2tablespoonssoy sauce",
            "▢1tablespoonsugar",
            "▢1tablespooncorn syrup or oligodangor use 1/2 tablespoon more sugar",
            "▢1tablespoongarlic",
            "▢1/2teaspoonsalt",
            "▢pinchpepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the rice cakes for about 20 minutes if hardened or refrigerated. Make anchovy broth (see note)."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the cabbage, fish cake, and scallions into about 2-inch long pieces. Thinly slice the onion."
            },
            {
                "@type": "HowToStep",
                "text": "Mix all the seasoning ingredients in a small bowl with 3 tablespoons of the broth or water."
            },
            {
                "@type": "HowToStep",
                "text": "Add the anchovy broth (or water) to a large pan or shallow pot. Stir in the prepared seasoning mix. Bring it to a boil over medium high heat."
            },
            {
                "@type": "HowToStep",
                "text": "Add the rice cakes and cook, stirring occasionally. When the rice cakes started to soften, throw in the vegetables, fish cakes, and the optional eggs. Continue to boil, stirring occasionally, until the rice cakes and vegetables are soft, about 10 minutes. Add the optional noodles with 2 minutes remaining."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "This soupy Korean spicy rice cake (tteokbokki) uses a lot more broth so the spicy, flavorful broth can be enjoyed along with the rice cakes."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 34,
        "name": "Gujeolpan (Platter of Nine Delicacies)",
        "image": "images/recipe_34_gujeolpan_platter_of_nine_delicacies_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢4ounceslean beef",
            "▢2teaspoonssoy sauce",
            "▢1teaspoonsugar",
            "▢1/2teaspoonminced garlic",
            "▢1teaspoonsesame oil",
            "▢Pinchpepper",
            "▢3dried shiitake mushroomssoaked (or 3 ounces fresh shiitake)",
            "▢1/2teaspoonsoy sauce",
            "▢1/4teaspoongarlic",
            "▢1/4teaspoonsugar",
            "▢1teaspoonsesame oil",
            "▢pinchsalt and pepper",
            "▢2kirby cucumbersor 1 long variety cucumber",
            "▢1medium zucchini",
            "▢1medium carrot",
            "▢5large shrimpde-veined",
            "▢3large eggs",
            "▢Batter:makes about 24 pancakes",
            "▢1cupflour",
            "▢1/2teaspoonsalt",
            "▢1 - ⅓cupwater",
            "▢1tablespoonprepared hot mustard",
            "▢1teaspoonsugar",
            "▢1tablespoonvinegar",
            "▢1teaspoonsoy sauce",
            "▢1tablespoonwateror maesilcheong, Korean plum extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the beef into thin strips (about 3-inch long). Remove the stems off the soaked mushrooms. If the mushrooms are thick, place the stem side down, and carefully slice parallel to the cutting board. Then cut into thin strips."
            },
            {
                "@type": "HowToStep",
                "text": "Season the beef and mushrooms with the seasoning ingredients."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the cucumbers crosswise into 2-½ inch long sections. Cut each one into thin sheets discarding the seedy part, and then cut into matchsticks."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the zucchini crosswise into 2-½ inch long sections. Cut each one into thin sheets, discarding the soft, seedy part, and then cut into matchsticks."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the carrot into matchsticks."
            },
            {
                "@type": "HowToStep",
                "text": "Bring a small pot of water to a boil. To keep the shrimp straight after cooked, insert a toothpick straight through the leg part of each shrimp. Cook briefly, about a minute. Quickly drain and dump in cold water to stop cooking. Drain again. Remove the toothpicks. Cut into thin strips."
            },
            {
                "@type": "HowToStep",
                "text": "Add the flour and salt to a bowl. Stir in 1 - ⅓ cups of cold water, and mix well. The batter should be thin."
            },
            {
                "@type": "HowToStep",
                "text": "Separate the eggs. Lightly beat the white by gently cutting it with a spoon. Stir the yoke with a spoon until smooth. Heat a lightly oiled nonstick skillet over medium low heat. Pour each egg part into a thin layer, spreading with a spoon. Cook each side briefly. Do not brown the egg. Cool then first cut into 2-½ inch wide sheets, and then into thin strips."
            },
            {
                "@type": "HowToStep",
                "text": "Heat the pan over medium high, add a half tablespoon of oil, and briefly cook each ingredient, sprinkling with a pinch of salt, in this order: cucumber, zucchini, carrot, mushroom, and beef,. Transfer to a large plate."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a lightly oiled non-stick pan over medium low heat. Add one tablespoon of the pancake mixture into the pan, and spread it evenly into a thin round shape (about 3 inch round) with a back of the spoon. Cook until the edges start to lift up slightly, about 30 seconds, and flip over for another 30 seconds. Transfer to a large plate. Repeat until all the mixture is used."
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the filling ingredients, placing the same/similar color foods on opposite sides. Stack the pancakes up and place in the center section of the platter."
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix the hot mustard paste and sugar until the sugar is dissolved. Add the remaining liquid ingredients and mix well again. Serve with the gujeolpan."
            }
        ],
        "recipeYield": "Servings:6",
        "prepTime": null,
        "cookTime": null,
        "description": "Gujeolpan is a beautiful and nutritionally well-balanced Korean traditional platter with 8 delicate fillings that are served with thin crepe-like pancakes."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 35,
        "name": "Buchujeon (Garlic Chive Pancakes)",
        "image": "images/recipe_35_buchujeon_garlic_chive_pancakes_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢Makes 2 large pancakes or 6 small ones",
            "▢1cupKorean pancake mix (buchimgaru, 부침가루)or simply use all purpose flour or gluten free flour with 1/2 teaspoon salt - see note",
            "▢3ouncesgarlic chivesbuchu, 부추",
            "▢1/4medium onion",
            "▢1teaspoonsoup soy sauceor regular soy sauce or fish sauce",
            "▢1cupKorean pancake mixbuchimgaru, 부침가루",
            "▢3ouncesgarlic chivesbuchu, 부추",
            "▢1/4medium onion",
            "▢1tablespoongochujangKorean chili pepper paste",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1tablespoonwater",
            "▢1/2teaspoonsugar",
            "▢pinchof black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the garlic chives into about 2-inch length pieces. Thinly slice the onion."
            },
            {
                "@type": "HowToStep",
                "text": "Add the pancake mix to a large bowl. Stir in 1 cup of icy cold water and the soy sauce (or gochujang for the spicy version) and mix lightly. The batter should be thin."
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the garlic chives and onion."
            },
            {
                "@type": "HowToStep",
                "text": "Heat one tablespoon of oil in a non-stick pan over medium heat. Ladle the mixture into the pan, and spread it evenly into a thin round shape. Cook until the edges turn light golden brown, about 2 to 3 minutes. Reduce the heat to medium low if the pancake browns too quickly. Turn it over, adding more oil to the sides of the pan, and press it down with a spatula. Cook until the other side is light golden brown, about 2 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Repeat the process until there is no remaining batter and the optional spicy version. Serve with a dipping sauce."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": "PTPrep Time:10minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": "Savory pancakes are a big part of Korean home cooking. The recipe here is buchujeon, which is made with garlic chives. It's delicious and simple to make!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 36,
        "name": "KKanpung Saeu (Sweet and Spicy Shrimp)",
        "image": "images/recipe_36_kkanpung_saeu_sweet_and_spicy_shrimp_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundlarge shrimpabout 22 large shrimp, peeled and deveined",
            "▢Oil for frying",
            "▢8tablespoonspotato starch",
            "▢1egg",
            "▢4 to 5small dried red hot peppersroughly cut",
            "▢5garlic clovesthinly sliced",
            "▢1-inchgingerthinly julienned",
            "▢1scallionfinely chopped",
            "▢1/4medium onionfinely diced",
            "▢1/4red bell pepperor 1 red chili pepper, finely diced",
            "▢1green chili pepperfinely diced",
            "▢2tablespoonssoy sauce",
            "▢2tablespoonsoyster sauce",
            "▢2tablespoonsplus 1 teaspoon sugar",
            "▢2tablespoonsvinegar",
            "▢1tablespoonlemon juice",
            "▢2tablespoonsrice or dry white wineor use more water",
            "▢2tablespoonswateror chicken or dashima broth",
            "▢1/2tablespoonsesame oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Clean the shrimp, drain, and pat dry with paper towels. Lightly sprinkle with salt and pepper. Let it sit until ready to coat with the batter."
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the vegetables."
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix all the sauce ingredients, except the sesame oil, well until the sugar is dissolved."
            },
            {
                "@type": "HowToStep",
                "text": "Add the starch and egg to the bowl with the shrimp. Mix everything well by hand until there's no visible starch powder and the shrimp is evenly coated with the batter."
            },
            {
                "@type": "HowToStep",
                "text": "Add 4 cups of oil to a deep fryer, wok, or large pot. Heat over high heat to 340°F or until a drop of batter in the oil moderately bubbles up to the surface. Using metal tongs or chopsticks, drop the shrimp in the oil one at a time, in two batches. Cook until lightly golden, about a minute."
            },
            {
                "@type": "HowToStep",
                "text": "Remove them quickly with a wire skimmer or a slotted spoon. Drain on a wire rack or in a large mesh strainer set on a bowl. Reheat the oil to 340°F between the batches and for the second frying."
            },
            {
                "@type": "HowToStep",
                "text": "Add the shrimp (you can do this in one batch for the second frying) and briefly deep fry again until lightly golden brown. Drain on a wire rack or in a large mesh strainer."
            },
            {
                "@type": "HowToStep",
                "text": "In a large pan or wok, add the dried pepper and 3 tablespoons of deep-frying oil over low heat until the oil starts to turn red. This only takes a few seconds. Do not burn the peppers."
            },
            {
                "@type": "HowToStep",
                "text": "Turn up the heat to high. Add the garlic, ginger, onion, and scallion, and stir fry briefly until fragrant. Stir in the green chili pepper and red bell (or chili) pepper, and cook for an additional minute or two."
            },
            {
                "@type": "HowToStep",
                "text": "Add the sauce, and boil for a couple of minutes until the sauce is slightly thickened, about 2 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Drop the shrimp into the pan, and quickly stir everything together until the sauce is almost absorbed. Drizzle the sesame oil, and toss everything together again. Serve immediately."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "kkanpung shrimp is a Korean-Chinese dish that's deep-fried and glazed in a sweet, sour and spicy sauce. it’s easy to make at home!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 37,
        "name": "Tteok Sanjeok (Skewered Rice Cake with Beef and Vegetables)",
        "image": "images/recipe_37_tteok_sanjeok_skewered_rice_cake_with_beef_and_vegetables_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2piecesgaraetteoksufficient for 4 7-centimeter long pieces",
            "▢1tablespoonsoy sauce",
            "▢2teaspoonssugar",
            "▢1teaspoonsesame oil",
            "▢4ounceslean beeftenderloin, sirloin, eye round",
            "▢1tablespoonsoy sauce",
            "▢2teaspoonssugar",
            "▢1teaspoonsesame oil",
            "▢1teaspoonrice wine",
            "▢1teaspoonminced garlic",
            "▢pinchpepper",
            "▢4king trumpet mushroomssaesongi beoseot",
            "▢2small carrots",
            "▢4scallions",
            "▢salt and pepper",
            "▢oil for pan frying",
            "▢sesame seeds or chopped pine nuts for garnish - optional",
            "▢8skewersabout 4-inch long"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut each rice cake crosswise into about 3-inch long pieces. Then cut each piece into quarters. (Day old rice cake is best for cutting.) Boil the rice cake in a small pot of boiling water until softened. Drain, and mix with the soy sauce, sugar and sesame oil, and let sit for about 30 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the beef into about 3.5-inch long strips to create 8 pieces. (Cut the beef longer than the rice cake because the beef will shrink more.) Combine with the soy sauce, sugar, sesame oil, rice wine, minced garlic, and pepper. Marinate for about 30 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the mushrooms lengthwise into about 8-centimeter long strips. Blanch them in salted boiling water just to soften, about a minute. Drain."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the green parts of scallions into 8 3-inch long pieces. Cut the carrots into 2 3-inch long pieces. Then cut each one into quarters."
            },
            {
                "@type": "HowToStep",
                "text": "Thread the rice cake, meat and vegetables onto the skewers."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large pan with a little bit of oil over medium low heat. Place the skewers in the pan. Cook each side until the meat and vegetables are cooked through and slightly caramelized, 1 – 2 minutes each side. Garnish with the optional sesame seeds or pine nuts."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "Sanjeok is a variety of jeok – skewered meat and vegetables. Unlike some other jeok varieties, sanjeok is not flour- or egg-battered. The ingredients are"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 38,
        "name": "Eggplant rolls (Gaji Mari)",
        "image": "images/recipe_38_eggplant_rolls_gaji_mari_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2Asian eggplantslong and thick - see note",
            "▢2 to 3tablespoonsof perilla or sesame oilor olive oil",
            "▢salt and pepper",
            "▢1package of alfalfa sproutsor any sprouts",
            "▢3ouncesof red cabbagethinly sliced",
            "▢1/4red bell pepper",
            "▢1/4orange bell pepper",
            "▢1/4yellow bell pepper",
            "▢1/4green bell pepper",
            "▢1package of enoki mushrooms",
            "▢2teaspoonsKorean hot mustardyeon gyeoja, 연겨자 or dijon mustard",
            "▢2tablespoonsvinegar",
            "▢1tablespoonrice syrupor sugar",
            "▢2tablespoonjuice from grated pearor apple juice or 1 tablespoon Korean plum syrup",
            "▢⅛teaspoonsalt",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonvinegar",
            "▢1teaspoonsugar",
            "▢1tablespoonKorean plum extractor apple juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare the filling vegetables by thinly slicing."
            },
            {
                "@type": "HowToStep",
                "text": "Thinly slice the eggplant lengthwise by running a peeler through the eggplant while pressing it down as hard as you can. Putting pressure on the peeler will help with cutting even slices that are as thick as possible with a peeler. You can also use a mandoline to slice the eggplant."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a pan with a tablespoon of oil. Place the eggplant slices in a single layer, lightly sprinkle with salt and pepper, and cook briefly over medium heat, 1 or 2 minutes per each side. Transfer to a plate."
            },
            {
                "@type": "HowToStep",
                "text": "Lay an eggplant slice on a flat surface. Place assorted vegetables on top at one end of the eggplant slice and roll up all the way. Repeat until all eggplant slices are used up."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "a vegan recipe for gorgeous, easy-to-make, Korean-style eggplant rolls!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 39,
        "name": "Korean Temple Food and Hobak Mandu",
        "image": "images/recipe_39_korean_temple_food_and_hobak_mandu.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢24dumpling wrappers",
            "▢2zucchinisabout 10 ounces each",
            "▢1teaspoonsalt",
            "▢4dried pyogo beoseot, 표고버섯 (shiitake mushrooms)soaked (or use fresh) - optional",
            "▢1/2tablespoonsoup soy sauce, 국간장 (or 1 tablespoon regular soy sauce)or 1/4 teaspoon salt",
            "▢sesame oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the zucchinis into thin disks and then into matchsticks. If the disks are big, cut in half before cutting into matchsticks. Lightly sprinkle with salt (about 1 teaspoon), and let sit for about 15 minutes until wilted and some liquid is released. Gently squeeze the liquid out from the zucchini."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the mushrooms into thin strips. If the mushrooms are thick, slice them diagonally once or twice as if you are butterflying the mushrooms, and then cut into thin strips. Mix with the soup soy sauce (or salt) and a little bit (about ½ teaspoon) of sesame oil."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a pan over high heat, and add two teaspoons of sesame oil and the zucchini. Stir fry until the zucchini is cooked and dry. Transfer to a large plate and spread it around to cool."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a pan over medium high heat, and stir fry the mushrooms for 2 minutes. Add a tablespoon or two of water or mushroom soaked water if the pan gets too dry."
            },
            {
                "@type": "HowToStep",
                "text": "Combine the zucchini and mushrooms. Adjust the seasoning to taste if needed."
            },
            {
                "@type": "HowToStep",
                "text": "Place one heaping teaspoonful of the filling on a wrapper placed on your palm. Wet the edges of the wrapper with water, fold the wrapper and seal tightly (pushing the air out with your fingers) into a half-moon shape. You can pinch one side of the wrapper to form pleats. Repeat this process until all the filling/wrappers are used."
            },
            {
                "@type": "HowToStep",
                "text": "Bring a pot of water to a boil. Add the dumplings a few at a time, stirring gently so they don’t stick to the bottom of the pot. Cook only until the dumplings come up to the surface. Prepare a bowl with cold water. Remove the dumplings quickly, and plunge in the cold water to cool."
            },
            {
                "@type": "HowToStep",
                "text": "Remove and serve cold with a dipping sauce (2 teaspoons soy sauce, 1 teaspoon vinegar, and 2 teaspoons water) if desired."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "Korean temple food has been increasingly popular in Korea by health conscious people, as well-being, healing food. Here are five basic things you should know and an easy temple style dumpling recipe."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 40,
        "name": "Tuna Gimbap",
        "image": "images/recipe_40_tuna_gimbap.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢2cupsstandard measuring cup not the cup that comes with a rice cooker uncooked short grain rice",
            "▢1-1/2tablespoonssesame oil",
            "▢salt to tasteabout 1/2 teaspoon",
            "▢2cans5 to 6 ounces tuna, drained well",
            "▢2tablespoonsfinely diced celery",
            "▢2tablespoonsmayonnaise",
            "▢1teaspoondijon mustard",
            "▢2teaspoonslemon juice",
            "▢saltstart with ¼ teaspoon and pepper to taste",
            "▢10romaine lettuce leavesonly use green leafy part",
            "▢10perilla leaves",
            "▢3kirby cucumberscut into thick sticks or julienned (do not used seedy part)",
            "▢5strips pre-cut pickled radish단무지",
            "▢10 3-inchpieces imitation crab meatcrab sticks",
            "▢5sheets gim"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook the rice using a little less water than usual. (Fresh cooked rice is best for gimbap.)"
            },
            {
                "@type": "HowToStep",
                "text": "Drain the tuna well in a strainer. Press with a spoon to force more liquid to drain."
            },
            {
                "@type": "HowToStep",
                "text": "Mix well with the celery, mayonnaise, dijon mustard, and lemon juice. Season with salt and pepper to taste."
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the other ingredients. Make sure the vegetables are dry. Pat the crab sticks and pickled radish with a paper towel to remove excess water."
            },
            {
                "@type": "HowToStep",
                "text": "When all the other ingredients are ready, remove the rice from the rice cooker. While the rice is still hot, add the sesame oil and salt. Mix well by lightly folding with a rice paddle or large spoon until evenly seasoned. The rice will cool down during this process and be ready to be used."
            },
            {
                "@type": "HowToStep",
                "text": "Put a sheet of gim, shiny side down with the longer side toward you, on a cutting board or a bamboo mat if available. Spread about 3/4 of rice evenly over the gim using a rice paddle or preferably your fingers."
            },
            {
                "@type": "HowToStep",
                "text": "Lay two lettuce leaves and two perilla leaves on top of the rice, close to you, and then the tuna and other prepared ingredients."
            },
            {
                "@type": "HowToStep",
                "text": "Lift the entire bottom edge with both hands, and roll over the filling away from you, bringing it to the other end of rice and tucking in the filling with your fingers. Put firm pressure over the roll with the help of the bamboo mat, if using, to close everything in tightly. Then, continue to roll again, putting pressure evenly over the roll using both hands."
            },
            {
                "@type": "HowToStep",
                "text": "Rub or brush the roll with a little bit of sesame oil for extra flavor and a shiny look. Apply a little bit of sesame oil to a sharp knife. This will keep rice from sticking to the knife. Repeat as necessary after each cut. Wipe the knife with a damp towel if the rice still sticks. Cut the roll into 1/2-inch bite sizes."
            }
        ],
        "recipeYield": "Servings:5",
        "prepTime": null,
        "cookTime": null,
        "description": "Another gimbap (Korean seaweed rice rolls) recipe! This time it's made with canned tuna. I kept it simple so the tuna really stands out in this recipe."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 41,
        "name": "Mini Gimbap (Mayak Gimbap)",
        "image": "images/recipe_41_mini_gimbap_mayak_gimbap_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢Makes 16 pieces",
            "▢1-1/2cupsuncooked short grain ricestandard measuring cup not the cup that comes with a rice cooker",
            "▢2teaspoonssesame oil",
            "▢salt to tastestart with ⅓ teaspoon",
            "▢1small bunch spinachabout 6 ounces",
            "▢1teaspoonsesame oil",
            "▢salt to taste – about 1/4 teaspoon",
            "▢1large carrotjulienned",
            "▢4yellow pickled radishdanmuji strips, pre-cut for gimbap",
            "▢4gimaka nori sheets",
            "▢1tablespoonsesame seedsfinely ground in a spice grinder or mortar bowl",
            "▢1tablespoonvinegar",
            "▢1teaspoonsoy sauce",
            "▢1teaspoondijon mustardor Korean hot mustard, gyeoja",
            "▢⅛teaspoonsalt",
            "▢2teaspoonssugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook the rice using a little less water than usual. (Fresh cooked rice is best for gimbap.)"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil over high heat and prepare an ice bath. Blanch the spinach, place immediately in the ice bath, then squeeze the water out. Run a knife through the squeezed spinach a couple of times. Season with the sesame oil and salt."
            },
            {
                "@type": "HowToStep",
                "text": "Julienne the carrots. Heat a lightly oiled pan over medium high heat. Stir fry the carrots until slightly softened. Lightly season with a pinch of salt."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the pickled radish crosswise in half, and then cut lengthwise in half."
            },
            {
                "@type": "HowToStep",
                "text": "When all the ingredients are ready, remove the rice from the rice cooker. While the rice is still hot, add the sesame oil and salt. Mix well by lightly folding with a rice paddle or spoon until evenly seasoned."
            },
            {
                "@type": "HowToStep",
                "text": "Cut 4 sheets of gim into quarters."
            },
            {
                "@type": "HowToStep",
                "text": "Put a quarter sheet of gim, shiny side down and shorter side toward you, on a cutting board. Spread 1 tablespoon to 1-1/2 tablespoons of rice evenly over the gim, leaving a little bit of space on the side away from you. Do this with your fingers. Keep wet towel and wipe your fingers frequently to keep the rice from sticking to your fingers. Lay the prepared ingredients on top of the rice, closer towards you."
            },
            {
                "@type": "HowToStep",
                "text": "Lift the entire bottom edge with both hands and roll over the filling away from you, tucking in the filling with your fingers."
            },
            {
                "@type": "HowToStep",
                "text": "Rub or brush the roll with a little bit of sesame oil for extra flavor and a shiny look."
            },
            {
                "@type": "HowToStep",
                "text": "Finely grind the sesame seeds in a spice grinder or mortar bowl. Mix with the remaining sauce ingredients. Stir well until the sugar is dissolved and the ground sesame seeds are evenly distributed."
            }
        ],
        "recipeYield": "Servings:2",
        "prepTime": null,
        "cookTime": null,
        "description": "This mini gimbap or kimbap is so addictive that it's called mayak gimbap, meaning drug gimbap. It's minimalist kimbap that's addictive."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 42,
        "name": "Yukjeon (Pan-fried Battered Beef)",
        "image": "images/recipe_42_yukjeon_pan_fried_battered_beef_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1poundthinly sliced beefany tender cut such as loin and rib eye",
            "▢1/2cupsweet rice flourchapssal garu, 찹쌀가루",
            "▢oil for pan-frying",
            "▢2scallionsthinly sliced",
            "▢1tablespoonsoy sauce",
            "▢1teaspoonrice wine",
            "▢2teaspoonswater",
            "▢1teaspoonsesame oil",
            "▢1teaspoonsugar",
            "▢pinchpepper",
            "▢1/2teaspoonminced garlic",
            "▢1teaspoonhot mustardgyeoja, 겨자",
            "▢1teaspoonhot water",
            "▢1teaspoonsoy sauce",
            "▢1teaspoonvinegar",
            "▢1teaspoonsugar",
            "▢pinchsalt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Thinly slice the beef if it’s not pre-cut. Partially freeze the meat for about an hour to firm it up for easier slicing."
            },
            {
                "@type": "HowToStep",
                "text": "Lightly season both sides with the marinade, and let it stand for 20 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Dredge both sides of the beef slice in sweet rice flour, one piece at a time. Let it stand for a few minutes until the flour absorbs the marinade. Then, dredge again in the sweet rice flour to create a nice coating."
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large non-stick skillet over medium low heat. Add a tablespoon of oil. Place in the skillet. Cook for 1 to 2 minutes on each side, adding more oil if needed, until lightly golden."
            },
            {
                "@type": "HowToStep",
                "text": "Repeat until all the beef slices are pan fried. Serve warm with a dipping sauce."
            },
            {
                "@type": "HowToStep",
                "text": "Mix the hot mustard in hot water. Let it stand for a few minutes for the flavor to develop. This step is very important, or the mustard sauce will taste bitter."
            },
            {
                "@type": "HowToStep",
                "text": "Mix int the other ingredients, and serve as a dipping sauce."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "Yukjeon(육전) is a type of jeon (pan-fried battered food) that’s made with thinly sliced beef. It’s atraditional holiday or special occasiondish. A Korean"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 43,
        "name": "Danpatjuk (Sweet Red Bean Porridge)",
        "image": "images/recipe_43_danpatjuk_sweet_red_bean_porridge_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1cuppat, 팥 (aka adzuki beans)",
            "▢1tablespoonglutinous rice flour (aka sweet rice powder)Chapssal garu (찹쌀가루) or mochiko",
            "▢2tablespoonssugar (or light brown sugar)",
            "▢1tablespoonhoney (use more sugar to taste if unavailable)",
            "▢½teaspoonsalt",
            "▢1/2cupglutinous rice powder (aka sweet rice powder)Chapssal garu (찹쌀가루) or mochiko",
            "▢2teaspoonssugar",
            "▢pinchsalt",
            "▢4tablespoonsboiling hot water",
            "▢1tablespoonpine nuts",
            "▢4 to 6boiled chestnuts (or canned)",
            "▢1/4 to 1/2teaspooncinnamon powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Discard broken or rotten beans and rinse the beans. In a large pot, add the beans with 4 cups of water. Bring it to a boil, uncovered, over medium high heat. Reduce the heat to medium and boil for 5 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Drain the beans."
            },
            {
                "@type": "HowToStep",
                "text": "Return the beans to the pot with 4 cups of fresh water. Cover, and simmer over medium low heat until the beans are very soft and easily breakable, about 1 to 1-½ hours. Turn off the heat, and let the beans cool in the cooking liquid."
            },
            {
                "@type": "HowToStep",
                "text": "Puree the beans along with the cooking liquid until velvety smooth. You may need to do this step in two batches. Add some water if the bean puree gets too thick."
            },
            {
                "@type": "HowToStep",
                "text": "Return the bean puree to the pot. Mix one tablespoon of the sweet rice powder in ½ cup of water, and pour into the pot. Stir in the salt, sugar and honey."
            },
            {
                "@type": "HowToStep",
                "text": "Simmer over medium low heat, uncovered, stirring frequently, for about 10 minutes. Adjust the thickness of the porridge by adding more water if necessary."
            },
            {
                "@type": "HowToStep",
                "text": "Mix the rice powder, sugar and salt in a bowl. Stir in the boiling hot water with a spoon. When cool enough to handle, knead by hand until a dough is formed. Shape the dough into a 3/4-inch thick cylinder."
            },
            {
                "@type": "HowToStep",
                "text": "Cut into (or pinch off) 3/4-inch pieces. Roll each piece between the palms to make a small ball."
            },
            {
                "@type": "HowToStep",
                "text": "Bring a pot of water to a boil. Add the rice cake balls. Cook until all the balls float. Transfer to a large bowl with cold water to cool. Drain."
            },
            {
                "@type": "HowToStep",
                "text": "Ladle some porridge into a serving bowl. Serve hot with a few rice balls and optional garnishes."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "A sweet, velvety smooth Korean porridge made with red beans! I love anything made with these small red beans called pat(팥) (aka azuki or adzuki beans)."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 44,
        "name": "Myulchu Gimbap",
        "image": "images/recipe_44_myulchu_gimbap.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [],
        "recipeInstructions": [],
        "recipeYield": null,
        "prepTime": null,
        "cookTime": null,
        "description": "  Have you heard of myulchu gimbap (멸추김밥)? It's a relatively new variation of gimbap (or kimbap) that was created by a gimbap"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 45,
        "name": "Kkaennip Jeon (Pan-fried Stuffed Perilla Leaves)",
        "image": "images/recipe_45_kkaennip_jeon_pan_fried_stuffed_perilla_leaves_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢12kkaennipperilla pieces",
            "▢4ounceszucchini",
            "▢1/4teaspoonsalt",
            "▢1/2small carrot",
            "▢2 to 3mushroom caps",
            "▢1/4small onion",
            "▢1/2teaspoonminced garlic",
            "▢4ouncesground beefor pork",
            "▢1teaspoonsoy sauce",
            "▢1teaspoonsesame oil",
            "▢salt (about 1/4 teaspoon) and pepper",
            "▢1tablespoonegg batterfrom the batter ingredient",
            "▢1/4cupflour",
            "▢3large eggs, beaten well",
            "▢cooking oil for pan frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Finely chop the zucchini. Lightly salt. Set aside for about 10 minutes. Squeeze out the liquid. Finely chop the carrot, mushrooms, and onion. Combine all the stuffing ingredients well by hand until evenly blended."
            },
            {
                "@type": "HowToStep",
                "text": "Wash both sides of the perilla leaves under running water, one leaf at a time. Shake off the excess water. Do not dry completely. Dredge both sides of the perilla leaves in the flour, one leaf at a time."
            },
            {
                "@type": "HowToStep",
                "text": "Place a perilla leaf on your hand. Add about a tablespoon of stuffing to the upper half of the perilla leaf. Spread evenly with a spoon. Bring the other half of the leaf over to cover the stuffing. Lightly flatten it with your hand. (Do this step for each leaf before the next step.)"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large non-stick skillet and lightly oil, using a couple of teaspoons of oil, over medium low heat. Dip each stuffed leaf, one at a time, in the egg batter, carefully placing it in the heated skillet."
            },
            {
                "@type": "HowToStep",
                "text": "Cook for 2 to 3 minutes each side, adding a teaspoon or two of oil, until slightly golden without browning. Repeat until all the pieces are pan-fried. Serve warm with a dipping sauce."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the zucchini into 1/2 inch-thick rounds. Cut out the interior with a spoon (or a melon baller). Lightly sprinkle with salt. Let sit for about 20 minutes. Pat dry excess water with a paper towel. Dredge in flour. Fill the opening with the stuffing. Coat the stuffed zucchini lightly with the flour. Dip in the egg batter. Follow the directions above to cook."
            },
            {
                "@type": "HowToStep",
                "text": "Cut the peppers in half lengthwise. Dredge in flour. Stuff the peppers. Coat the stuffed peppers lightly with the flour. Dip in the egg batter. Follow the directions above to cook."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": "PTPrep Time:20minutesminutes",
        "cookTime": "PTCook Time:10minutesminutes",
        "description": " This perilla jeon is a type of Korean jeon that's stuffed, egg-battered and pan-fried. The perilla leaves give a nice flavor and textural contrast"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 46,
        "name": "Saewu Ganghwe (Green Onion Tied Shrimp and Asparagus)",
        "image": "images/recipe_46_saewu_ganghwe_green_onion_tied_shrimp_and_asparagus_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢16medium shrimp41 – 50 per pound sizes, peeled, tail on, and deveined",
            "▢8thin asparagus stalks",
            "▢16thin green onionsscallions",
            "▢1tablespoonlemon juiceor vinegar",
            "▢1tablespoongochujangKorean red chili pepper paste",
            "▢1/2tablespoonsugar",
            "▢1/4teaspoonminced garlicoptional",
            "▢Mix well and set aside."
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a medium pot of water to a boil. Add the shrimp, and cook briefly, about a minute. Quickly drain and dump in cold water to stop cooking. Drain. You can cut small slits on the inner curve of the curled up shrimp to flatten a little for easier wrapping."
            },
            {
                "@type": "HowToStep",
                "text": "Remove the tough ends of the asparagus. Cut into about 2-inch lengths. Blanch them in salted boiling water until softened, about a minute. Remove with a strainer, and shock in cold water. Drain. To the same pot of boiling water, add the white parts of the green onions, and hold for about 30 seconds before submerging the whole scallions briefly to soften, about 20 seconds. Drain, and shock in cold water. Pat the green onions dry with a kitchen towel or paper towel by gently pressing to remove excess water."
            },
            {
                "@type": "HowToStep",
                "text": "To assemble, hold a shrimp and an asparagus piece together along with the white end of a green onion. Tie them together by wrapping the other end of the green onion around the shrimp and asparagus several times."
            },
            {
                "@type": "HowToStep",
                "text": "Use a chopstick or a toothpick to tuck the end of the green onion into the roll.  Serve with the gochujang sauce."
            }
        ],
        "recipeYield": "Servings:0",
        "prepTime": null,
        "cookTime": null,
        "description": "Impress your family or guests with these little Korean delicacies made tying poached shrimp with blanched spring onion and served with a gochujang sauce!"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 47,
        "name": "Jjukkumi Gui (Spicy Grilled Baby Octopus)",
        "image": "images/recipe_47_jjukkumi_gui_spicy_grilled_baby_octopus_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1pound10 - 12 baby octopus",
            "▢1small cucumberthinly sliced, for garnish (optional)",
            "▢2tablespoonsKorean red chili pepper pastegochujang",
            "▢1 to 2teaspoonsKorean red chili pepper flakesgochugaru",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonrice wineor mirin",
            "▢2tablespoonssugar",
            "▢1teaspoonminced garlic",
            "▢1/2teaspoonfinely grated ginger",
            "▢1tablespoonsesame oil",
            "▢1teaspoonsesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Defrost, if frozen. If not pre-cleaned, remove and discard the inside of the head and beak. See more here. Rinse the octopus well under cold running water."
            },
            {
                "@type": "HowToStep",
                "text": "Combine the marinade ingredients. Pour over the octopus and mix to coat well. Marinate for 2 to 3 hours (up to overnight) in the fridge. Heat a lightly oiled grill or a grill pan to medium high and sear for about 3 minutes, turning a couple of times. Do not overcook. Plate them on the optional cucumber slices to serve."
            }
        ],
        "recipeYield": "Servings:0",
        "prepTime": null,
        "cookTime": null,
        "description": "Baby octopus are marinated in a spicy gochujang sauce and seared quickly on the grill. Tender, enjoyably chewy, not to mention a burst of flavor with"
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 48,
        "name": "Galbi Taco (Korean-Style Taco with Beef Short Ribs)",
        "image": "images/recipe_48_galbi_taco_korean_style_taco_with_beef_short_ribs_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [],
        "recipeInstructions": [],
        "recipeYield": null,
        "prepTime": null,
        "cookTime": null,
        "description": "  The idea to place Korean BBQ meat on a Mexican corn tortilla topped with a mix of Korean and Mexican flavors has been around quite some time."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 49,
        "name": "Modeumjeon (Fish, Shrimp and Zucchini Jeon)",
        "image": "images/recipe_49_modeumjeon_fish_shrimp_and_zucchini_jeon_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢1zucchini",
            "▢10shrimpmedium to large",
            "▢1/2poundflounder or cod filletor any white fish",
            "▢salt and pepper",
            "▢3eggsbeaten",
            "▢1/2cupflour",
            "▢vegetable or canola oil for pan frying",
            "▢1tablespoonsoy sauce",
            "▢1tablespoonrice vinegar",
            "▢pinchpepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Slice the zucchini into ⅓- inch disks. Lightly salt both sides and set aside at least for 20 minutes. Pat dry excess water with a paper towel."
            },
            {
                "@type": "HowToStep",
                "text": "Peel and devein the shrimp, keeping the tail on. Rinse and pat dry with a paper towel. Butterfly the shrimp by cutting along the curved back. Do NOT cut through. Open the shrimp halves and remove the vein. Lightly sprinkle salt and pepper over both sides. Set aside at least for 15 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Rinse fish and pat dry with a paper towel. Cut the fish fillet into 1/2-inch thick, 2-inch long slices by running the knife diagonally through the fillet. Lightly sprinkle salt and pepper over both sides. Set aside at least for 15 minutes."
            },
            {
                "@type": "HowToStep",
                "text": "Dredge both sides of the prepared ingredients in flour, one piece at a time. (Do this step for all the pieces before the next step.)"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large non-stick skillet with a tablespoon oil over medium low heat. Dip each piece one at a time in the beaten egg, and carefully place in the heated skillet."
            },
            {
                "@type": "HowToStep",
                "text": "Cook for 1 to 2 minutes each side, adding more oil if needed, until slightly golden."
            },
            {
                "@type": "HowToStep",
                "text": "Repeat until all the ingredients are pan fried. Add an additional tablespoon of oil each time. Serve warm with the dipping sauce."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "A platter of zucchini, fish and shrimp pan-fried in egg batter! Small Korean delicacies that are great as an appetizer or side dish."
    },
    {
        "@context": "https://schema.org",
        "@type": "Recipe",
        "id": 50,
        "name": "Deep-Fried Pork Rolls (Dwaegi Gogi Mari Twiguim)",
        "image": "images/recipe_50_deep_fried_pork_rolls_dwaegi_gogi_mari_twiguim_.jpg",
        "author": "Korean Bapsang",
        "datePublished": "2024-11-11",
        "recipeIngredient": [
            "▢8thin pork slicesabout ⅛ - inch thick",
            "▢1teaspoonfresh ginger gratedor 1/2 teaspoon ginger powder",
            "▢salt and pepper",
            "▢8Korean perilla leavesavailable in Korean markets",
            "▢3 - 4green chili peppersor 1 green bell pepper, julienned",
            "▢3 - 4red chili peppersor 1 red bell pepper, julienned",
            "▢1cuptwiguim garupremade tempura batter mix*",
            "▢3/4cupice water",
            "▢1/4cupall-purpose flour for dredging",
            "▢canola or vegetable oil for deep frying",
            "▢*A premade batter mix can be found in Korean/Asian markets. If unavailable, beat 1 egg yolk in a bowl and mix in 3/4 cup ice water. Add 1 cup of flour. Mix until combined."
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season the pork slices with ginger, salt and pepper. Set aside while preparing vegetables.Wash the perilla leaves and pat dry them. Julienne the peppers, about 4-inches long."
            },
            {
                "@type": "HowToStep",
                "text": "To put together a roll, dredge a pork slice in the flour and place it on a flat surface. Place a perilla leaf on top along with 4 or 5 pieces of each color pepper. Wrap the pork and perilla leaf around the pepper pieces, folding in the sides. Roll up to form a nice finger shape. Repeat the process with the remaining ingredients. Set aside while preparing the oil and the batter."
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil to 375 degrees (or until it barely starts to smoke). In a small bowl, mix the batter with ice water for only a few seconds just until combined. (It is okay to have some visible lumps in the mixture. Do NOT over mix.)"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the pork rolls in the flour to coat lightly. Shake off excess. Dip one pork roll at a time in the batter, coat well."
            },
            {
                "@type": "HowToStep",
                "text": "Carefully add to the hot oil. Fry only 4 at a time, depending on the size of the fryer. (Overcrowding the oil will lower the temperature of the oil, resulting in soggy and oily rolls.) Flip over and fry until golden on both sides, about 3 minutes. Transfer to a wire rack. Wait until the oil reaches 375 again before frying the second batch."
            },
            {
                "@type": "HowToStep",
                "text": "Serve immediately with asauce."
            }
        ],
        "recipeYield": "Servings:4",
        "prepTime": null,
        "cookTime": null,
        "description": "These little delights are great for parties! Prepare ahead of time and fry them right before serving. Sure to be a big crowd pleaser!"
    }
]